{
  "331025 331024": {
    "name": "Algebra A CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "This course primarily covers linear, quadratic and exponential functions. For these function families, students will use equation solving, graphing, and connections between different representations to analyze contextual problems. Supporting concepts include inequalities, absolute value, polynomials, exponents, radicals and basic statistics. This course is designed to address the first half of the Algebra 1 topics.",
    "Prerequisites": "Teacher recommendation",
    "Counseling Notes": "This course requires a TI-84+ graphing calculator. *331024 is a co-requisite of 333102. They must be taken in the same year."
  },
  "331026 333102": {
    "name": "Algebra B CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "This course primarily covers linear, quadratic and exponential functions. For these function families, students will use equation solving, graphing, and connections between different representations to analyze contextual problems. Supporting concepts include inequalities, absolute value, polynomials, exponents, radicals and basic statistics. This course is designed to address all of the Algebra 1 topics. Students are required to take the TNReady end-of-course Exam with the exam score included as a part of the student’s final grade in the course.",
    "Prerequisites": "Algebra 1A CP, teacher recommendation",
    "Counseling Notes": "This course requires a TI-84+ graphing calculator. *331024 is a co-requisite of 333102. They must be taken in the same year."
  },
  "313102": {
    "name": "Algebra 1 CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "This course primarily covers linear, quadratic and exponential functions. For these function families, students will use equation solving, graphing, and connections between different representations to analyze contextual problems. Supporting concepts include inequalities, absolute value, polynomials, exponents, and basic statistics. This course is designed to address all Algebra 1 topics. Students are required to take the TNReady end of-course Exam with the exam score included as a part of the student’s final grade in the course.",
    "Prerequisites": "None",
    "Counseling Notes": "This course requires a TI-84+ graphing calculator."
  },
  "303132 323081": {
    "name": "Algebra 1 Advanced*",
    "GPA": "4.25",
    "Credits": ["2.0"],
    "Subject": ["Math"],
    "Length": ["Year-long Block"],
    "Description": "This course primarily covers linear, quadratic and exponential functions. For these function families, students will use equation solving, graphing, and connections between different representations to analyze contextual problems. Supporting concepts include inequalities, absolute value, polynomials, exponents, and basic statistics. This course is designed to address all Algebra 1 topics. Students are required to take the TNReady end-of-course Exam with the exam score included as a part of the student’s final grade in the course.",
    "Prerequisites": "Open to students who have successfully mastered computational skills and are able to reason abstractly. These students would not be current honors students, but are capable of rigorous mathematics and motivated to reach an AP mathematics course",
    "Counseling Notes": "This course requires a TI-84 calculator. The first semester is a Math Elective Credit with the Algebra 1 credit applied to the second semester."
  },
  "331085 331083": {
    "name": "Geometry A CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "This is a course in Euclidean Geometry. The primary emphasis is on the development of deductive reasoning and analytical problem-solving skills utilizing the relationships between geometric figures and their properties.",
    "Prerequisites": "Algebra 1, teacher recommendation",
    "Counseling Notes": "This course requires a TI-84 calculator. *331083 is a co-requisite of 341083.  They must both be taken in the same year."
  },
  "331086 341083": {
    "name": "Geometry B CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "This is a course in Euclidean Geometry. The primary emphasis is on the development of deductive reasoning and analytical problem solving skills utilizing the relationships between geometric figures and their properties. Students are required to take the TNReady end-of-course Exam with the exam score included as a part of the student’s final grade in the course.",
    "Prerequisites": "Algebra 1, Geometry A CP, teacher recommendation",
    "Counseling Notes": "This course requires a TI-84 calculator. *331083 is a co-requisite of 341083.  They must both be taken in the same year."
  },
  "323108": {
    "name": "Geometry CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "This is a course in Euclidean Geometry. The primary emphasis is on the development of deductive reasoning and analytical problem-solving skills utilizing the relationships between geometric figures and their properties. This course contains the full scope and sequence of the Geometry curriculum. Students are required to take the TNReady end-of-course Exam with the exam score included as a part of the student’s final grade in the course.",
    "Prerequisites": "Algebra 1",
    "Counseling Notes": "This course requires a TI-84 calculator."
  },
  "303133": {
    "name": "Geometry Advanced",
    "GPA": "4.25",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "This is a course in Euclidean Geometry. The primary emphasis is on the development of deductive reasoning and analytical problem-solving skills utilizing the relationships between geometric figures and their properties. This course contains the full scope and sequence of the Geometry curriculum. Students are required to take the TNReady end-of-course Exam with the exam score included as a part of the student’s final grade in the course.",
    "Prerequisites": "Algebra 1 Advanced",
    "Counseling Notes": "This course requires a TI-84 calculator."
  },
  "333108": {
    "name": "Geometry Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "This is a comprehensive course in Euclidean Geometry, which covers plane, solid, and analytic geometry concepts. Honors Geometry involves theoretical and analytical proofs, as well as applications in transformational geometry. This course includes all topics of Geometry and additional topics in Trigonometry at a depth considered appropriate preparation for Algebra 2 Trig Honors. Students are required to take the",
    "Prerequisites": "http://www.ortn.edu/central-office/teaching-and-learning/curriculum/high-school/",
    "Counseling Notes": "Algebra 1Honors or Algebra 1 Advanced"
  },
  "313103": {
    "name": "Algebra 2 CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "This course includes all the topics of Algebra 2 at a depth. Students are required to take the TNReady End-ofCourse Exam in Algebra 2 with the exam score included as a part of the student’s final grade in the course. Junior and Senior Algebra 2 students making unsatisfactory progress toward earning this required State credit will be assigned to Algebra 2 Core Focus Intervention.",
    "Prerequisites": "Algebra 1 and Geometry",
    "Counseling Notes": "This course requires the use of a TI-84 Graphing Calculator."
  },
  "343103": {
    "name": "Algebra 2 Advanced",
    "GPA": "4.25",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "This course includes all the topics of Algebra 2 and additional topics in Trigonometry at a depth considered appropriate preparation for Pre-calculus AB SWDC. Students are required to take the TNReady End-of-Course Exam in Algebra 2 with the exam score included as a part of the student’s final grade in the course.",
    "Prerequisites": "Algebra 1 and Geometry",
    "Counseling Notes": "This course requires the use of a TI-84 Graphing Calculator."
  },
  "323103": {
    "name": "Algebra 2 Trigonometry Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "This course includes all the topics of Algebra 2 and additional topics in Trigonometry at a depth considered appropriate preparation for Pre-calculus BC SWDC.  A technology laboratory consisting of approximately 1.5 hours (outside of class) per nine weeks period is encouraged to increase proficiency on the graphing calculator. Students are required to take the TNReady End-of-Course Exam in Algebra 2 with the exam score included as a part of the student’s final grade in the course.",
    "Prerequisites": "Algebra 1 and Geometry, Honors",
    "Counseling Notes": "This course requires the use of a TI-84 Graphing Calculator."
  },
  "313126": {
    "name": "Precalculus AB SWDC",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "Precalculus AB SWDC is designed to prepare students for college level STEM focused courses.  Students use previous knowledge to continue progressing in their understanding of polynomial, rational, exponential, logarithmic, and trigonometric functions, and extend learning in the following topics areas: vectors, conic sections, parametric equations, and regression analysis to model quantitative data. This course will offer State Dual Credit upon successful completion of the State Precalculus Challenge Exam.",
    "Prerequisites": "Algebra 2 Adv",
    "Counseling Notes": "This course requires the use of a TI-89 graphing calculator. Students completing this course are prepared for AP Calculus AB."
  },
  "323126": {
    "name": "Precalculus BC SWDC",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "Emphasis is placed on a rigorous problem-solving approach and mathematical development with calculator enhancement of the following topics: number theory, sequences and series, limit theory, probability, data analysis/statistics, polynomial functions, rational functions, logarithmic and exponential functions, trigonometric functions, analytic geometry, parametrics, and vectors.   This course will offer State Dual Credit upon successful completion of the State Precalculus Challenge Exam.",
    "Prerequisites": "Algebra 2/Trigonometry, Honors.",
    "Counseling Notes": "This course requires the use of a TI-89 graphing calculator.  Students completing this course may be qualified for AP Calculus BC."
  },
  "334011": {
    "name": "DE Precalculus",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "Pre-calculus is designed to prepare students for college level STEM focused courses.  Students who take this course will dually enroll at Roane State Community College.  This course is designed primarily for students planning to enter the calculus sequence in college. Topics include functions and graphing-algebraic, trigonometric, exponential and logarithmic, equations, the binomial theorem, and conics.",
    "Prerequisites": "Algebra 2; 3.0 GPA; 23 or higher on the math portion of the ACT",
    "Counseling Notes": "A calculator with trig and log functions will be needed by the student. See the Dual Enrollment Section of the Academic Planning Guide for more information about registering for dual enrollment credit.   This course is only open to Seniors."
  },
  "303181": {
    "name": "SAILS Math",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "SAILS is a course designed to allow students whose ACT is 18 or less in the math section an opportunity to earn their college remedial math credit. SAILS is a 2-part course. The first part focuses on the remedial math credit, while the second part provides students with the opportunity to earn an entry level college math credit while preparing them for college algebra.",
    "Prerequisites": "Algebra 2",
    "Counseling Notes": "Only for seniors with an 18 or lower on the math portion of the ACT or comparable score on the mathematics portion of the SAT."
  },
  "333183": {
    "name": "Applied Mathematical Concepts",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "Applied Mathematical Concepts is primarily focused on mathematics as applied to real life problems. Topics of study include financial mathematics, linear programming, Logic and Boolean Algebra, as well as topics in probability and statistics. This course satisfies the state requirement for the fourth year of mathematics.",
    "Prerequisites": "Algebra 2",
    "Counseling Notes": "This course requires the use of a TI-84 graphing calculator. This course is only open to Seniors."
  },
  "314013": {
    "name": "Statistics SWDC or DE Statistics",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "The four major themes of this course include: (1) Exploring Data, (2) Probability, (3) Probability Distributions, and (4) Sampling and Experimentation.   This course will offer State Dual Credit upon successful completion of the State Statistics Challenge Exam.",
    "Prerequisites": "Algebra 2; 19 or higher on the math portion of the ACT",
    "Counseling Notes": "This course requires the use of a TI-84 graphing calculator. This course is only open to Seniors."
  },
  "323129": {
    "name": "AP Statistics",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "The four major themes of this course include: (1) Exploring Data: Describing patterns and departures from patterns, (2) Sampling and Experimentation: Planning and conducting a study, (3) Anticipating Patterns: Exploring random phenomena using probability distributions and simulation, and (4) Statistical Inference: Estimating population parameters and testing hypotheses. This course will be taught at the level of a college statistics course with the expectation that enrollees will likely take the AP Exam in May for a chance at college credit.",
    "Prerequisites": "Algebra 2",
    "Counseling Notes": "This course requires the use of a TI-84 graphing calculator"
  },
  "323127": {
    "name": "AP Calculus AB",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "This course will cover levels (A) and (B) seen under the AP Calculus-BC description.",
    "Prerequisites": "Pre-calculus AB SWDC or Pre-calculus BC SWDC",
    "Counseling Notes": "The Advanced Placement Testing Program will require the use of a graphing calculator on the AP Calculus AB and BC exams. This component increases the instructional time for additional content in the AP curriculum. This course requires the use of a TI-89 graphing calculator. The Advanced Placement Calculus AB and BC exams are available for a fee for those students desiring to receive advanced placement credit at the college level."
  },
  "323128": {
    "name": "AP Calculus BC",
    "GPA": "5.0",
    "Credits": ["2.0"],
    "Subject": ["Math"],
    "Length": ["Year-long Block"],
    "Description": "There are three levels of course work in the Advanced Placement Calculus curriculum:(A) Differential Calculus; (B) Integral Calculus; (C) Further applications of differential and integral calculus including formal integration, indeterminate forms, plane curve geometry, infinite series, and differential equations. Advanced Placement curricular outlines with more detailed descriptions of the courses are available through the calculus teachers.",
    "Prerequisites": "Pre-calculus BC SWDC",
    "Counseling Notes": "The Advanced Placement Testing Program will require the use of a graphing calculator on the AP Calculus AB and BC exams. This component increases the instructional time needed for additional content into the AP curriculum. This course requires the use of a TI-89 graphing calculator. The Advanced Placement Calculus AB and BC exams are available for a fee for those students desiring to receive advanced placement credit at the college level."
  },
  "323199": {
    "name": "DE Linear Algebra",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester"],
    "Description": "An introductory course in matrix algebra for mathematics, science and engineering students along with appropriate applications. Topics covered include Systems of linear equations, matrix algebra, inverses, matrix factorizations, determinants, vector spaces and dimension, rank, linear transformations, eigenvalues and eigenvectors, inner product, orthogonal projections. This course is equivalent to MATH 2010 at Tennessee Tech University and students have the opportunity for dual enrollment.",
    "Prerequisites": " Open to students who have completed AP Calculus BC with a minimum grade of C and a 3 or higher on the AP Exam. Select students with high A averages from Precalculus BC SWDC will be considered for this course if it is taken simultaneously with AP Calculus BC. The latter students must receive the recommendation of the Precalculus BC SWDC instructor.",
    "Counseling Notes": "This course requires the use of a TI-89 calculator. Dual enrollment opportunity with Tennessee Tech. This course must be taken in conjunction with DE Multivariable Calculus and DE Differential Equations in order to satisfy the math graduation requirement."
  },
  "343199": {
    "name": "DE Multivariable Calculus",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Term"],
    "Description": "This course covers typical topics from Calculus 3 including analytic geometry and vectors, differential calculus of functions of several variables, multiple integration, and topics from vector calculus. This course is equivalent to MATH 2110 at Tennessee Tech University and students have the opportunity for dual enrollment.",
    "Prerequisites": " Open to students who have completed AP Calculus BC with a minimum grade of C and a 3 or higher on the AP Exam. Select students with high A averages from Precalculus BC SWDC will be considered for this course if it is taken simultaneously with AP Calculus BC. The latter students must receive the recommendation of the Precalculus BC SWDC instructor.",
    "Counseling Notes": " This course requires the use of a TI-89 calculator. Dual enrollment opportunity with Tennessee Tech. This course must be taken in conjunction with Linear Algebra and Differential Equations in order to satisfy the math graduation requirement."
  },
  "363199": {
    "name": "DE Differential Equations",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Term"],
    "Description": "An introductory course in differential equations. Topics covered include an introduction to Differential Equations and Terminology, First Order Differential Equations, Higher Order Homogeneous Linear Equations with Constant Coefficients, Cauchy-Euler Equations, The Laplace Transform method of solving Initial-Value Problems, Solutions of Linear Equations, Systems of Linear Differential Equations. This course is equivalent to MATH 2120 at Tennessee Tech University and students have the opportunity for dual enrollment.",
    "Prerequisites": "Open to students who have completed AP Calculus BC with a minimum grade of C and a 3 or higher on the AP Exam. Select students with high A averages from Precalculus BC SWDC will be considered for this course if it is taken simultaneously with AP Calculus BC. The latter students must receive the recommendation of the Precalculus BC SWDC instructor.",
    "Counseling Notes": "This course requires the use of a TI-89 calculator. Dual enrollment opportunity with Tennessee Tech. This course must be taken in conjunction with Linear Algebra and Multivariable Calculus in order to satisfy the math graduation requirement."
  },
  "313199": {
    "name": "Math, Science, and Computer Science Thesis 1",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester plus summer research"],
    "Description": "This course is designed to draw upon the expertise of scientific professionals in the community to serve as advisors for the student's thesis project. The statement of the problem to be studied, methodology employed, results with analysis and conclusions will be presented by the student in a 18 – 20 page written document at the culmination of the project. Such projects must involve computer science work to receive credit.",
    "Prerequisites": "Linear Algebra, Multivariable Calculus, Differential Equations and/or teacher recommendation",
    "Counseling Notes": "This course requires work over the summer between 10th and 11th grades."
  },
  "333199": {
    "name": "Math, Science, and Computer Science Thesis 2",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Math"],
    "Length": ["Semester plus summer research"],
    "Description": "This course is designed to continue the research started in Thesis 1. Students will focus on research presentation through posters, oral presentations and a 18 – 20 page written document at the culmination of the project.",
    "Prerequisites": "Linear Algebra, Multivariable Calculus, Differential Equations, and teacher recommendation",
    "Counseling Notes": "This course requires work over the summer between 11th and 12th grades."
  },
  "413260": {
    "name": "Environmental and Applied Sciences",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Science"],
    "Length": ["Semester"],
    "Description": "This course focuses on scientific literacy, investigative practices, and applied math skills.  Students investigate relevant phenomena and are introduced to a variety of scientific topics including neuroscience, environmental science, computer science, and physical science concepts. This course prepares students to successfully engage in advanced science content later in their academic careers.",
    "Prerequisites": "Teacher recommendation",
    "Counseling Notes": "A $10 lab fee is requested."
  },
  "403210": {
    "name": "Biology, CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Science"],
    "Length": ["Semester"],
    "Description": "Biology, CP introduces students to the world of living things. The goal is to develop an understanding of the diversity and unity in life. Concepts covered include basic life processes, interdependence and interactions within the environment, evidence of biological evolution, and current and emerging technologies in the life sciences. This course prepares students to succeed on the Tennessee Biology End of Course Exam.",
    "Prerequisites": "Physical Science",
    "Counseling Notes": " A $10 lab fee is requested."
  },
  "413210": {
    "name": "Biology, Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["Science"],
    "Length": ["Semester"],
    "Description": "Biology, Honors students explore biology on many different levels – molecular, cellular, and systems. Students are introduced to topics such as biochemistry, genetics, and ecology. Honors students are challenged to apply their knowledge in hands-on open-ended investigations. Honors students explore in depth topics to enhance their overall understanding of biological principles. This course prepares students to succeed on the Tennessee Biology End of Course Exam.",
    "Prerequisites": "Teacher Recommendation",
    "Counseling Notes": "A $10 lab fee is requested."
  },
  "403221": {
    "name": "Chemistry, CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Science"],
    "Length": ["Semester"],
    "Description": "Chemistry, CP is an introductory chemistry course designed to give students an overview of chemistry in order to prepare them for college. This conceptual approach to chemistry focuses on guided inquiry, atomic structure, energy, mathematical modeling, and qualitative interactions of matter through problem-based learning.",
    "Prerequisites": "Biology and Algebra 1",
    "Counseling Notes": "A $10 lab fee is requested."
  },
  "423221": {
    "name": "Chemistry, Advanced",
    "GPA": "4.25",
    "Credits": ["1.0"],
    "Subject": ["Science"],
    "Length": ["Semester"],
    "Description": "Chemistry Advanced is an introductory chemistry course designed to give students an in-depth study of chemistry in order to prepare them for college and STEM related fields. This analytical approach to chemistry focuses on inquiry, modern atomic theory, interactions of matter, thermochemistry, qualitative and quantitative analyses of chemical reactions, solutions, and acid-base chemistry.",
    "Prerequisites": "Biology, Algebra 1",
    "Counseling Notes": "A $10 lab fee is requested."
  },
  "413221": {
    "name": "Chemistry, Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["Science"],
    "Length": ["Semester"],
    "Description": "This course is designed to be an accelerated, comprehensive survey of introductory chemistry topics including, but not limited to, atomic and molecular theories, interactions of matter, thermodynamics, qualitative and quantitative analyses of chemical reactions, solutions and solution stoichiometry, equilibria, and acid-base chemistry. Throughout the year, mathematical reasoning, laboratory investigation, and critical thinking will be emphasized. The content is specifically designed to prepare students for Advanced Placement (AP) Chemistry.",
    "Prerequisites": "Biology, and Honors Geometry or Geometry Advanced",
    "Counseling Notes": "A $10 lab fee is requested. Rising 9th graders may register for Honors Chemistry and Honors Biology simultaneously; however, this option should be limited to the strongest of students due to the workload required by these courses."
  },
  "403295": {
    "name": "Astronomy, Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["Science"],
    "Length": ["Semester"],
    "Description": "Astronomy is a student-centered course determined to provide a basic understanding of the structure of the universe while allowing students to pursue their specific interests, including observational astronomy and authentic scientific research. Special attention is given to the introduction of tools for analyzing astronomical images, computer modeling, and simulations of the night sky. Advanced mathematical skills are not required; a passion for the night sky and asking questions is a must.",
    "Prerequisites": "Geometry and Chemistry or Physics",
    "Counseling Notes": "None"
  },
  "423231": {
    "name": "Physics, CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Science"],
    "Length": ["Semester"],
    "Description": "Physics is an introductory survey course of the three major branches of physics: mechanics, waves, and electromagnetism. The course is intended to help all students meet the state graduation requirement for a physics or chemistry course. Physics is meant to reinforce math skills such as algebraic manipulations and graphing. An emphasis on real world applications and hands-on laboratories are a feature of this course.",
    "Prerequisites": "Biology and Algebra 1",
    "Counseling Notes": "The course is taken in conjunction with Algebra 2 or Geometry B. A $10 lab fee is requested."
  },
  "433232": {
    "name": "Physics, Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["Science"],
    "Length": ["Semester"],
    "Description": "Physics, Honors is a college preparatory level introduction to basic Physics concepts including kinematics, projectiles, dynamics, work and energy, momentum and collisions, waves, electricity, and magnetism. Mathematics including algebra, systems of equations, graphing and basic trigonometry are required to investigate these topics on this level. Laboratories, reference, research and design skills will be emphasized.",
    "Prerequisites": "Biology and Geometry",
    "Counseling Notes": "This course should be taken in conjunction with Algebra 2 or higher math. A $10 lab fee is requested."
  },
  "423216": {
    "name": "Biology II, Honors",
    "GPA": "0.5 and 1.0 ",
    "Credits": ["1.0"],
    "Subject": ["Science"],
    "Length": ["Year-long on a block"],
    "Description": "Biology II is an honors level course designed for students desiring an in-depth, formal background in biology and to gain the foundations needed to continue into the AP Biology course.  AP Biology is an introductory collegelevel biology course. Students cultivate their understanding of biology through inquiry-based investigations as they explore topics like evolution, energetics, information storage and transfer, and system interactions. The course will prepare students for the AP Biology exam.",
    "Prerequisites": "Chemistry",
    "Counseling Notes": "Both courses must be taken during the same calendar year. A $20 lab fee is requested."
  },
  "423217": {
    "name": "AP Biology",
    "Credits": ["1.0"],
    "Subject": ["Science"]
  },
  "423222": {
    "name": "Chemistry II, Honors",
    "GPA": "5.5",
    "Credits": ["1.0"],
    "Subject": ["Science"],
    "Length": ["Year-long on a block"],
    "Description": "Chemistry II is an honors level course designed for students desiring an in-depth, formal background in chemistry and to gain the foundations needed to continue into the AP Chemistry course.  AP Chemistry is designed to be the equivalent of a general chemistry course taken during the first year of college. It is structured around the six big ideas articulated in the AP Chemistry curriculum framework provided by the College Board. The topics covered include: atomic structure, intermolecular forces and bonding, chemical reactions, kinetics, thermodynamics, acid/base equilibria, buffers, and electrochemistry.  The course will prepare students for the AP Chemistry exam.",
    "Prerequisites": "Chemistry",
    "Counseling Notes": "Both courses must be taken during the same calendar year. A $20 lab fee is requested."
  },
  "423225": {
    "name": "AP Chemistry",
    "Credits": ["1.0"],
    "Subject": ["Science"]
  },
  "423235": {
    "name": "Environmental Science, Honors",
    "GPA": "0.5 and 1.0 ",
    "Credits": ["1.0"],
    "Subject": ["Science"],
    "Length": ["Year-long on a block"],
    "Description": "Environmental Science is an honors level course designed for students desiring an in-depth, formal background in environmental science and to gain the foundations needed to continue into the AP Environmental Science course.  AP Environmental Science is designed to be the equivalent of a one semester, introductory college course in Environmental Science. This will be an interdisciplinary course and will draw from a wide variety of topics from different areas of study: biology, geology, ecology, chemistry, geography, and environmental studies. The goal of this course is to provide students with the scientific principles, concepts, and methodologies to understand the relationships of the natural world. It will allow them to identify and analyze problems which could be both natural and man-made and to evaluate the risks associated with these problems. They will also examine alternative solutions for resolving or preventing them. The course will prepare the student for the AP Environmental Science Exam.",
    "Prerequisites": "Chemistry",
    "Counseling Notes": "Both courses must be taken during the same calendar year. A $20 lab fee is requested."
  },
  "423236": {
    "name": "AP Environmental Science",
    "Credits": ["1.0"],
    "Subject": ["Science"]
  },
  "413231": {
    "name": "AP Physics 1",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Science"],
    "Length": ["Year-long on a block"],
    "Description": "AP Physics 1 and 2 is for students planning to major in science or engineering in college. The course covers the College Board standards for both algebra-based AP Physics courses including mechanics, dynamics, waves and light, electromagnetism, thermodynamics, optics and modern Physics. It is the required prerequisite course for calculus based AP Physics C.",
    "Prerequisites": "Algebra II Trigonometry and Honors Chem, Co-requisite: Pre-calculus",
    "Counseling Notes": "This course moves very quickly and has quite a bit of homework and labs several times per week. Students should be very fluent in math and able to handle a large workload. A $20 lab fee is requested."
  },
  "433233": {
    "name": "AP Physics 2",
    "Credits": ["1.0"],
    "Subject": ["Science"]
  },
  "423234": {
    "name": "AP Physics C",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Science"],
    "Length": ["Semester"],
    "Description": "Physics C is a calculus-based course designed primarily for students who wish to pursue studies in science or engineering in college. The course will prepare students for Physics C AP exams. The course focuses on the college equivalent of one semester of mechanics and one semester of electricity and magnetism.",
    "Prerequisites": "AP Physics 1 AND AP Physics 2 OR a score of 3 on BOTH AP Physics 1 AND AP Physics 2 Exams",
    "Counseling Notes": "Students need to have had an exposure to both Mechanics and E&M prior to adding the calculus in this course. A $20 lab fee is requested."
  },
  "423251": {
    "name": "Anatomy and Physiology, Honors",
    "GPA": "4.5",
    "Credits": ["1.0", "1.0"],
    "Subject": ["Science", "Career Academies"],
    "Length": ["Semester"],
    "Description": "Anatomy and Physiology, Honors is the study of the body’s structures and respective functions at the molecular, cellular, tissue, organ, systemic, and organism levels. Students explore the body systems through laboratory investigations, models, diagrams, and/or comparative studies of the anatomy of other organisms. The study of anatomy and physiology prepares students for a variety of pursuits such as health care, sport and fitness careers, as well as for taking an active part in their own health and wellness.",
    "Prerequisites": "Chemistry",
    "Counseling Notes": "A $20 lab fee is requested. This course can satisfy one credit of a Health Science Academy area of focus and a credit of lab science graduation requirement simultaneously."
  },
  "420343": {
    "name": "Dual Enrollment Gross Anatomy",
    "GPA": "5.0",
    "Credits": ["1.0", "1.0"],
    "Subject": ["Science", "Science"],
    "Length": ["Semester"],
    "Description": "Students will learn the gross anatomy of the following systems: skeletal, muscular, nervous, circulatory, respiratory, digestive, urinary, and reproductive. The lab component of the course parallels & reinforces lecture concepts using prosected cadavers. Students will learn names & functions of anatomical structures and concepts to help them succeed in a college program. They will understand the 'big picture' of how anatomic systems work together, as well as understand and apply clinical relevance of anatomic structure. Lectures meet two times per week via digital lectures. Students also attend one 2-hr. lab per week. Lectures are relayed in individual high schools Labs are hosted at the LMU DCOM Medical School in Knoxville. Students must bring their own device. Students will meet with an ORHS instructor to work on coursework daily.",
    "Prerequisites": "Must apply & be accepted to LMU. Successful completion of High School Anatomy & Physiology.",
    "Counseling Notes": "  The Dual Enrollment Grant is not used for this course; it is being offered tuition-free.  However, students must purchase a textbook and scrubs at a cost of ~$100.  Students must also be able to provide their own transportation to LMU in Knoxville once per week."
  },
  "433260": {
    "name": "Wildlife Principles, Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["Science"],
    "Length": ["Semester"],
    "Description": "Wildlife Principles is designed as a specialized science course with its focus on critical thinking skills, management of multi-solution problems, and real-world techniques used to promote conservation and proper wildlife management. Studies involving real-world scenarios and techniques allows students utilize higher-order thinking skills, while preparing them for potential vocation in the sciences. Within the context of wildlife problems and management, students also witness how economics and politics affect decision making, and how our decisions have shaped the current state of Wildlife. Current research methods and data interpretation are used throughout the course. This course is project-based, requires active participation, and is extremely rigorous.",
    "Prerequisites": "Chemistry",
    "Counseling Notes": "A $10 lab fee is requested."
  },
  "423167": {
    "name": "AP Capstone Seminar",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Science"],
    "Length": ["Semester"],
    "Description": "AP Seminar provides sustained practice of investigating issues from multiple perspectives and cultivates student writing abilities so they can craft, communicate, and defend evidence-based arguments. Students are empowered to collect and analyze information with accuracy and precision and are assessed through a team project and presentation, an individual written essay and presentation, and a written exam.  Students who earn scores of 3 or higher in AP Seminar and AP Research will receive the AP Seminar and Research Certificate™.  Students who also earn scores of 3 or higher on four additional AP Exams of their choice will receive the AP Capstone Diploma™.",
    "Prerequisites": "English 9 Honors",
    "Counseling Notes": " Offered during Spring semester only. This is an elective class and does not satisfy any science requirements.  It can be used toward an area of focus in humanities or Math/Science."
  },
  "433167": {
    "name": "AP Capstone Research",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Science"],
    "Length": ["Semester"],
    "Description": "In AP Research, students develop the skills and discipline necessary to conduct independent research to produce and defend a scholarly academic thesis. This second course in the AP Capstone experience allows students to explore deeply an academic topic, problem, or issue of individual interest and through this inquiry, students design, plan, and conduct a year-long mentored, research-based investigation. The course culminates in an academic thesis paper of approximately 5,000 words and a presentation, performance, or exhibition with an oral defense.  Students who earn scores of 3 or higher in AP Seminar and AP Research will receive the AP Seminar and Research Certificate™.  Students who also earn scores of 3 or higher on four additional AP Exams of their choice will receive the AP Capstone Diploma™.",
    "Prerequisites": "AP Capstone Seminar Score of 3 or Better",
    "Counseling Notes": " This is an elective class and does not satisfy any science requirements.  It may be used toward an area of focus in humanities or Math/Science."
  },
  "605786": {
    "name": "Welding I",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Welding I students will learn basics skills and knowledge related to cutting and welding applications. Course content includes safe practices, career research, leadership development, and basic arc welding and thermal cutting skills. Combined with the second and third year courses, Basic Principles of Welding and Welding. Applications and Certification, the student should be prepared for Entry Level Welder Certification, as defined by American Welding Society QC10.A written safety test must be passed with 100% before student is allowed to work in the lab. Membership in Skills USA is encouraged. Students will take certification tests for various welding processes and positions. Students who complete the three-course sequence should be prepared for Entry Level Welding Certification, as defined by American Welding Society, QC10.",
    "Prerequisites": "None.",
    "Counseling Notes": "This is the first course in the Welding path of study. Students who wish to pursue CCTE concentrator status must take 3 courses in a single pathway.  Welding gloves, safety glasses, and steel-toed leather boots are required for Lab Safety."
  },
  "615786": {
    "name": "Welding II",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Welding II is a course designed to follow Introduction to Welding, in which students will learn more advanced skills and knowledge related to cutting and welding applications. Development of welding and cutting skills will be continued in the context of a series of projects. Combined with the third course, Advanced Welding applications and Certification, the student should be prepared for Entry Level Welding Certification, as defined by American Welding Society QC10. Students will take certification tests for various welding processes and positions. Students that complete the three-course sequence should be prepared for Entry Level Welding Certification, as defined by American Welding Society, QC10.",
    "Prerequisites": "Welding I and instructor recommendation",
    "Counseling Notes": "This is the second course in the Welding path of study. Students who wish to pursue CCTE concentrator status must take 3 courses in a single pathway.  Welding gloves, safety glasses, and steel-toed leather boots are required for Lab Safety."
  },
  "605787": {
    "name": "DE Welding",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "DE Welding is a course designed to teach more advanced techniques and skills related to cutting and welding applications. Welding and cutting skills developed in Welding 1 and Welding 2 will be used to satisfactorily complete a series of industry certification tests. Following the completion of this course, including successful passage defined by American Welding Society QC10.",
    "Prerequisites": "Welding 2 and teacher recommendation.",
    "Counseling Notes": "This is the third course in the Welding path of study and may be repeated for additional hours of credit and certification. Students who wish to pursue CCTE concentrator status must take 3 courses in a single pathway. Welding gloves, safety glasses, and steel-toed leather boots are required for Lab Safety. Students will take certification tests for various welding processes and positions. Certification: Entry-Level American Welding Society, QC10. Dual Enrollment is available through Tennessee College of Applied Technology, Knoxville."
  },
  "605759": {
    "name": "Broadcasting 1",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "This is a foundational course in the Arts, A/V Technology & Communications cluster for students interested in A/V production occupations. Upon completion of this course, proficient students will be to explain and complete the phases of the production process including pre-production, production, and post-production. Students will establish basic skills in operating cameras and the technology and engineering of other production equipment. Standards in this course include career exploration, an overview of the history and evolution, and legal issues affecting A/V production. Students will learn digital editing, news research and writing, and ways to create complete informative news items. Much of the work produced will air on the school television channel.",
    "Prerequisites": "None",
    "Counseling Notes": "This is an introductory course to the A/V Production (Broadcasting) pathway. Students who wish to pursue CCTE concentrator status must take 3 courses in a single pathway."
  },
  "605764": {
    "name": "Dual Credit Broadcasting 2 Honors",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "This is the second course in the A/V Production program of study intended to prepare students for careers in audio/video production. Students will advance in technical skill in utilizing industry equipment related to video shooting and editing, and planning productions. Upon completion of this course, proficient students will be able to plan, capture, and edit productions of increasing complexity, individually and collaboratively in teams. In addition to more robust career preparation, standards in this course include an investigation of concerns affecting A/V production businesses, such as ethical and legal issues, technology/engineering, funding, and the organization of professional roles in various industries. Much of the work produced will air on the school television channel.",
    "Prerequisites": "Broadcasting 1",
    "Counseling Notes": "This is the second course in the A/V Production (Broadcasting) pathway. Students who wish to pursue CCTE concentrator status must take 3 courses in a single pathway. This course has a project opportunity for honors credit and/or dual credit with PSCC."
  },
  "605765": {
    "name": "Broadcasting 3 Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "This is an applied-knowledge course intended to prepare students to pursue careers and postsecondary learning in audio/video production. Students in this course will apply knowledge and skills from previous courses in the program of study to create productions both independently and in teams. Students will use industry equipment and technology to complete all phases of the production process, including planning, coordinating, capturing, editing, and distributing productions. Standards in this course include policies and regulations, independent and collaborative productions, distribution of media, and the production of live events. Upon completion of this course, proficient students will be prepared for a career in audio/video production or to transition to a postsecondary program for further study. All work produced will air on the school television channel.",
    "Prerequisites": "Broadcasting 2",
    "Counseling Notes": "This is the third course in the A/V Production (Broadcasting) pathway. Students who wish to pursue CCTE concentrator status must take 3 courses in a single pathway. This course has a project opportunity for honors credit and/or dual credit with PSCC."
  },
  "619393": {
    "name": "Applied Arts Practicum",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "The Applied Arts Practicum is a capstone course intended to provide students with the opportunity to apply the skills and knowledge learned in previous Arts, A/V Technology, & Communications courses within a professional, working environment. In addition to developing an understanding of the professional and ethical issues encountered by professionals in these careers, students learn to refine their skills in problem solving, research, communication, teamwork, and project management through the completion of a courselong project. The course is highly customizable to meet local system needs.  Instruction may be delivered through school laboratory training or through work-based learning arrangements such as internships, service learning, and job shadowing. Upon completion of the practicum, proficient students will be prepared to pursue postsecondary study in arts, A/V technology, or communications programs; or seek additional training or employment with the aid of the portfolio, which documents the student’s work completed throughout the program of study.",
    "Prerequisites": "Broadcasting or Digital Arts 3",
    "Counseling Notes": "This is the capstone course in the A/V Production (Broadcasting) and Digital Arts pathways. Students who wish to pursue CCTE concentrator status must take 3 courses in a single pathway."
  },
  "615759": {
    "name": "Digital Arts & Design 1",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "This is a foundational course in the Arts, A/V Technology & Communications academy for students interested in art and design professions. The primary aim of this course is to build a strong understanding of the principles and elements of design and the design process. Upon completion of this course, proficient students will be able to utilize industry tools to conceptualize and create communications solutions which effectively reach targeted audiences. Students will acquire basic skills in illustration, typography, and photography. Standards in this course include career exploration, an overview of the history of design, basic business management, and legal issues. Skills learned in this path of study translate well into other STEM design applications, such as CAD.",
    "Prerequisites": "None",
    "Counseling Notes": "This is an introductory course to the Digital Arts & Design pathway. Students who wish to CCTE concentrator status must take 3 courses in a single pathway. Only this Digital Arts class can satisfy the fine art graduation requirement and count toward an Arts and A/V Communication area of focus simultaneously."
  },
  "605761": {
    "name": "Digital Arts & Design 2",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "This is a course that builds on the basic principles and the design process learned in the introductory Digital Arts & Design I course. Upon completion of this course, proficient students will be able to perform advanced software operations to create photographs and illustrations of increasing complexity. Students will employ design principles and use industry software to create layouts for a variety of applications. Standards in this course also include an overview of art and design industries, career exploration, and business management.",
    "Prerequisites": "http://tn.gov/education/article/cte-cluster-arts-av-tech",
    "Counseling Notes": "Digital Arts & Design 1"
  },
  "605762": {
    "name": "Digital Arts & Design 3",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "This is the third course in the Digital Arts & Design program of study. Applying design skills developed in prior courses, students will expand their creative and critical thinking skills to create comprehensive multimedia projects and three-dimensional designs. Upon completion of this course, proficient students will be able to use industry-standard software to create multimedia projects, web pages, three- dimensional models, and animations. Students will utilize research techniques to plan and enhance project outcomes. Standards in this course also include professionalism and ethics, career exploration, and business and project management.",
    "Prerequisites": "Digital Arts & Design 2",
    "Counseling Notes": "This is the third course in the Digital Arts & Design pathway. Students who wish to pursue CCTE concentrator status must take 3 courses in a single pathway. This course has a project opportunity for honors credit and/or dual credit with PSCC. Students may wish to pursue Adobe Certification in this course. There is a requested $25 per month student-covered Adobe Creative Cloud fee. Certification: Adobe Photoshop and Illustrator"
  },
  "642107": {
    "name": "BioSTEM I",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "BioSTEM I is a foundational course in the STEM cluster for students interested in learning more about careers in science, technology, engineering, and mathematics with emphasis in biotechnology. This course covers basic skills required for BioSTEM fields of study. Upon completion of this course, proficient students are able to identify and explain the steps in both the engineering design and the scientific inquiry process. Students conduct research to develop meaningful questions, define simple problem scenarios and scientific investigations, develop fundamental design solutions, conduct basic mathematical modeling and data analysis, and effectively communicate solutions and scientific explanation to others.",
    "Prerequisites": "None",
    "Counseling Notes": "This course is a substitute for Genetics 1 and Genetics 2. This course satisfies one of three credits required for an elective focus when taken in conjunction with other BioSTEM courses. This course satisfies the third science graduation requirement, and it may be used toward a Math/Science area of focus or a BioSTEM area of focus."
  },
  "642108": {
    "name": "BioSTEM II",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "BioSTEM II is a project-based learning experience for students who wish to further explore the dynamic range of BioSTEM fields introduced in BioSTEM I. Building on the content and critical thinking frameworks of BioSTEM I, this course asks students to apply the scientific inquiry and engineering design processes to a course-long project selected by the instructor with the help of student input. Instructors design a project in one of the BioSTEM fields of medical laboratory science, research science, food science, forensic science or environmental science that reflects the interest of the class as a whole; the students then apply the steps of the scientific inquiry process throughout the course to ask questions, test hypotheses, model solutions, and communicate results. In some cases, instructors may be able to design hybrid projects that employ elements of several of the BioSTEM fields. Upon completion of this course, proficient students will have a thorough understanding of how scientists research problems and methodically apply BioSTEM knowledge and skills; and they will be able to present and defend a scientific explanation to comprehensive BioSTEM scenarios.",
    "Prerequisites": "BioSTEM I",
    "Counseling Notes": " This course satisfies one of three credits required for an elective focus when taken in conjunction with other BioSTEM courses. This course satisfies the third science graduation requirement, and it may be used toward a Math/Science area of focus or a BioSTEM area of focus."
  },
  "642109": {
    "name": "BioSTEM III",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "BioSTEM III is an applied course in the STEM career cluster which allows students to work in groups to solve a problem or answer a scientific question drawn from real-world scenarios within their schools or communities. This course builds on BioSTEM I and BioSTEM II by applying scientific knowledge and skills to a team project. Upon completion of this course, proficient students will be able to effectively use skills such as project management, team communication, leadership, and decision making. They will also be able to effectively transfer the teamwork skills from the classroom to a work setting.",
    "Prerequisites": "BioSTEM II",
    "Counseling Notes": " Coming soon! This course satisfies one of three credits required for an elective focus when taken in conjunction with other BioSTEM courses. This course satisfies the third science graduation requirement, and it may be used toward a Math/Science area of focus or a BioSTEM area of focus."
  },
  "642110": {
    "name": "BioSTEM Practicum",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "BioSTEM Practicum is the fourth course in the STEM cluster for students interested in learning more about careers in science, technology, engineering and mathematics with emphasis in Biotechnology. This course provides opportunity for students to use skills and content learned during the first three courses in a real world university or industry lab setting. Upon completion of this course, proficient students are able to identify, explain, and execute lab-based research utilizing the scientific inquiry processes. They will conduct research to develop meaningful questions, define simple problem scenarios and scientific investigations, develop fundamental design solutions, conduct basic mathematical modeling and data analysis, and effectively communicate solutions and scientific explanations to others. Students also will gain knowledge in how a biotechnology business works. Note: For clarity, some standards include example applications to science, technology, engineering, and mathematics. Teachers are encouraged to align instruction to one or more of these areas, depending on area of expertise and student interest.",
    "Prerequisites": "BioSTEM III",
    "Counseling Notes": " Coming soon!"
  },
  "605905": {
    "name": "Introduction to Business and Marketing",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Introduction to Business and Marketing is an introductory course designed to give students an overview of the Business Management and Administration, Marketing, and Finance career clusters. The course helps students prepare for the growing complexities of the business world by examining basic principles of business, marketing, and finance in addition to exploring key aspects of leadership, ethical and social responsibilities, and careers. Students’ academic skills in communications, mathematics, and economics are reinforced with activities modeled in the context of business topics. Upon completion of this course, proficient students will be equipped with the foundational skills to succeed in any of the Business, Marketing, or Finance programs of study and will be prepared to make an informed decision regarding which pathways they would like to pursue in high school.",
    "Prerequisites": "None",
    "Counseling Notes": "Proficiency in Microsoft Word is necessary for success in this course. Students who did not take the full semester class of Computer Applications while in middle school are strongly encouraged to take Computer Applications either prior to or concurrently with this course."
  },
  "623718": {
    "name": "Computer Applications A Honors",
    "GPA": "5.0",
    "Credits": ["0.5"],
    "Subject": ["Career Academies"],
    "Length": ["Year-long skinny at lunch"],
    "Description": "Computer Applications A is a foundational course intended to teach students the computing fundamentals and concepts involved in the use of common software applications including Microsoft Office 2016 Word, Excel, and PowerPoint. Upon completion of this course, students will gain basic proficiency in word processing, spreadsheets, and presentations. In addition, students will have engaged in key critical thinking skills and will have practiced ethical and appropriate behavior required for the responsible use of technology. Standards in this course are aligned with Tennessee State Standards for Literacy in Technical Subjects and Tennessee State Standards in Mathematics. The course credit for this class is a universal credit for any area of focus. Students will have the opportunity to earn Microsoft Office Specialist Certifications for free.",
    "Prerequisites": "None",
    "Counseling Notes": "The credit for this course is an elective for any area of focus. Students take this class all year when paired on the other side of the lunch period. For students waiving world language and/or fine art, Computer Applications is a universal enhancer credit for any area of focus. Students who complete a combination of Word, PPT, Excel, and Access certifications have opportunities to earn Dual Credit at RSCC and/or PSCC."
  },
  "603718": {
    "name": "Computer Applications A Honors",
    "GPA": "5.0",
    "Credits": ["0.5"],
    "Subject": ["Career Academies"],
    "Length": ["Term"],
    "Description": "Computer Applications A is a foundational course intended to teach students the computing fundamentals and concepts involved in the use of common software applications including Microsoft Office 2016 Word, Excel, and PowerPoint. Upon completion of this course, students will gain basic proficiency in word processing, spreadsheets, and presentations. In addition, students will have engaged in key critical thinking skills and will have practiced ethical and appropriate behavior required for the responsible use of technology. Standards in this course are aligned with Tennessee State Standards for Literacy in Technical Subjects and Tennessee State Standards in Mathematics. The course credit for this class is a universal credit for any area of focus. Students will have the opportunity to earn Microsoft Office Specialist Certifications for free.",
    "Prerequisites": "None",
    "Counseling Notes": "The credit for this course is an elective for any area of focus. Students may take this class during a regular period in the day or take it during a lunch or guided study period in lieu of a regular guided study. The ORHS Business Academy teachers will be happy to “test” the students to determine their level of proficiency in Microsoft Office Word, Microsoft Office Excel, and/or Microsoft Office PowerPoint. Students who pass all the Proficiency Tests may enroll in the Advanced Microsoft Office 2, Honors course as 9th graders. For students waiving world language and/or fine art, Computer Applications is a universal enhancer credit for any area of focus. Students who complete a combination of Word, PPT, Excel, and Access certifications have opportunities to earn Dual Credit at RSCC and/or PSCC."
  },
  "613718 643718": {
    "name": "Computer Applications B Honors",
    "GPA": "5.0",
    "Credits": ["0.5"],
    "Subject": ["Career Academies"],
    "Length": ["Term Or Year-long skinny at lunch"],
    "Description": "Computer Applications B is a course intended for students to learn the concepts associated with key application software, basic computing fundamentals, and ethics and appropriate behavior while using technology as a tool in the classroom and in life. The applications taught in this course are Microsoft Access and Publisher. Skills learned in Computer Applications A in Word, Excel, and PPT will be enhanced. Students will also have the opportunity to earn Microsoft Office Specialist Certifications for free through this course. Some colleges/universities recognize certifications and will award credit and/or the student may be exempt from beginning computer course(s).",
    "Prerequisites": "Computer Applications A",
    "Counseling Notes": "Students enrolled in Computer Applications B will have the opportunity to learn, practice, and certify in Microsoft products (MOS Certification). The credit for this course is an elective for any area of focus. The ORHS Business Academy teachers will be happy to “test” the students to determine their level of proficiency in Microsoft Office Word, Microsoft Office Excel, Microsoft Office Access and/or Microsoft Office PowerPoint. Students who pass all the Proficiency Tests may enroll in the Advanced Computer Applications, Honors course as 9th graders. In addition, Computer Applications is a universal enhancer credit for any area of focus for students who waive world language and/or fine art. Students who complete a combination of Word, PPT, Excel, and Access certifications have opportunities to earn Dual Credit at RSCC and/or PSCC."
  },
  "633718": {
    "name": "Computer Applications Honors",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Computer Applications is a foundational course intended to teach students the computing fundamentals and concepts involved in the use of common software applications including Microsoft Office 2016 Word, Excel, and PowerPoint. Upon completion of this course, students will gain basic proficiency in word processing, spreadsheets, and presentations. In addition, students will have engaged in key critical thinking skills and will have practiced ethical and appropriate behavior required for the responsible use of technology. Standards in this course are aligned with Tennessee State Standards for Literacy in Technical Subjects and Tennessee State Standards in Mathematics. The course credit for this class is a universal credit for any area of focus. Students will have the opportunity to earn Microsoft Office Specialist Certifications for free.",
    "Prerequisites": "None",
    "Counseling Notes": "The credit for this course is an elective for any area of focus. Students may take this class during a regular period in the day or take it during a lunch or guided study period in lieu of a regular guided study. The ORHS Business Academy teachers will be happy to “test” the students to determine their level of proficiency in Microsoft Office Word, Microsoft Office Excel, and/or Microsoft Office PowerPoint. Students who pass all the Proficiency Tests may enroll in the Advanced Microsoft Office 2, Honors course as 9th graders. For students waiving world language and/or fine art, Computer Applications is a universal enhancer credit for any area of focus. Students who complete a combination of Word, PPT, Excel, and Access certifications have opportunities to earn Dual Credit at RSCC and/or PSCC."
  },
  "603730": {
    "name": "Advanced Computer Applications + MOS Certification",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "This course prepares students to continue postsecondary training in business related programs, provides advanced training for students pursuing a career in administrative and information support, and supports obtaining an industry certification. Microsoft Office programs will be taught at an expert level.  Course content and projects are meant to simulate workplace scenarios and draw on skills related to communications, operations, management, and teamwork in order to accomplish information management goals. Upon completion of this course, proficient students will be fluent in a variety of information management software applications and will be prepared to sit for the Microsoft Office Specialist (MOS) certifications.  The completion of this course prepares students to pursue the Microsoft Office Specialist (MOS) certification(s) by taking the exam(s) at an official testing center (ORHS is an official testing center). Certification exams are available in Word, Excel, Access, PowerPoint, and Outlook. The students will be able to take the certification exams for free.",
    "Prerequisites": "Computer Applications A or acceptable scores on proficiency tests in Word, Excel, and PowerPoint",
    "Counseling Notes": "Students who complete this course as juniors or are enrolled in this course as seniors may apply to work in local businesses for additional work-experience course credit (one or two additional credits) during their senior year. See Work-Based Learning. Students who complete a combination of Word, PPT, Excel, and Access certifications have opportunities to earn Dual Credit at RSCC and/or PSCC."
  },
  "603779": {
    "name": "Accounting I CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "This course provides an introduction to the field of accounting. The principles of debit and credit, the accounting cycle, the analyzing and recording of business transactions, and the preparation of business reports for service and merchandising businesses organized either as sole proprietorships, partnerships, or corporations are studied. Current terminology, business forms, and procedures are used. Students will work through an entire accounting cycle for a service business organized as a sole proprietorship and a merchandising business organized as a corporation. One or more business simulations will also be used in this course. Computerized accounting programs will be used to reinforce and expand accounting concepts as time allows. The reasoning, organizing, and decision-making skills taught makes CP Accounting I a good course for any student planning a business career or any other professional career. A workbook is required.",
    "Prerequisites": "Instructor approval",
    "Counseling Notes": "Students who complete this course as juniors or are enrolled in this course as seniors may apply to work in local businesses for additional work-experience course credit (one or two additional credits) during their senior year. See Work-Based Learning."
  },
  "613779": {
    "name": "Accounting I Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Honors Option—any student wishing to take CP Accounting I for honors credit will be expected to complete additional assignments, independent projects, and take a comprehensive accounting examination. These additional assignments will be completed on an individualized instructional basis and will be graded. Students may elect this option once enrolled in the course.",
    "Prerequisites": "None",
    "Counseling Notes": "Students who complete this course as juniors or are enrolled in this course as seniors may apply to work in local businesses for additional work-experience course credit (one or two additional credits) during their senior year. See Work-Based Learning."
  },
  "623779": {
    "name": "DE Accounting 1",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "CP Accounting I, Dual Enrollment Option: students may choose to enroll in Roane State Community College’s beginning Accounting course while taking CP Accounting I at ORHS. Upon successfully passing the courses, students would receive one credit at ORHS and 3 credits at RSCC. It is suggested that students enroll in the RSCC course during the spring semester after having taken one semester of high school accounting. Lottery scholarship money is available to pay for the course. However, students would be responsible for a one-time registration fee and the cost of the textbook. More information will be provided at the beginning of the ORHS Accounting course.",
    "Prerequisites": "3.0 GPA and a 19 in Reading on the ACT",
    "Counseling Notes": "Only students planning to attend RSCC are encouraged to take this option since this one course does not fulfill the requirements of Accounting I at UTK and therefore would not transfer. Students who complete this course as juniors or are enrolled in this course as seniors may apply to work in local businesses for additional work-experience course credit (one or two additional credits) during their senior year. See Work-Based Learning."
  },
  "603780": {
    "name": "Accounting II CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "CP Accounting II CP is an advanced study of concepts, principles and techniques that build on the competencies acquired in Accounting I CP.  Students will apply these concepts, principles, and techniques used to keep the electronic and manual financial records of a sole proprietorship, partnership and corporation. Departmental, management, cost and not-for-profit accounting systems are explored. Computer-based accounting programs will be used to reinforce and expand accounting concepts as time allows. The reasoning, organizing, and decision-making skills taught make Accounting II CP an excellent course for any student planning a business career or any other professional career.",
    "Prerequisites": "Accounting 1 CP and instructor approval",
    "Counseling Notes": "Students who complete this course as juniors or are enrolled in this course as seniors may apply to work in local businesses for additional work-experience course credit (one or two additional credits) during their senior year. See Work-Based Learning."
  },
  "613780": {
    "name": "Accounting II Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Accounting II Honors is an advanced study of concepts, principles and techniques that build on the competencies acquired in Accounting I. Students will apply these concepts, principles, and techniques used to keep the electronic and manual financial records of a sole proprietorship, partnership and corporation. Departmental, management, cost and not-for-profit accounting systems are explored. Computer-based accounting programs will be used to reinforce and expand accounting concepts as time allows. The reasoning, organizing, and decision-making skills taught make Accounting 2 Honors an excellent course for any student planning a business career or any other professional career. For the honors option--extra fractional quality point value--any student wishing to take Accounting II CP for honors credit will be expected to complete additional assignments, independent projects, and take a comprehensive accounting examination. These additional assignments will be completed on an individualized instructional basis and will be graded. Students may elect this option once enrolled in the course.",
    "Prerequisites": "Accounting I CP with at least a C average and instructor approval",
    "Counseling Notes": "Students who complete this course as juniors or are enrolled in this course as seniors may apply to work in local businesses for additional work-experience course credit (one or two additional credits) during their senior year. See Work-Based Learning."
  },
  "623780": {
    "name": "DE Accounting II",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "DE Accounting II, Dual Enrollment Option: students may choose to enroll in Roane State Community College’s second level Accounting course while taking Accounting II CP at ORHS. Upon successfully passing the courses, students would receive one credit at ORHS and 3 credits at RSCC. 6 credits in Accounting from RSCC would satisfy UTK’s first level Accounting course.",
    "Prerequisites": "CP Accounting 1 with at least a C average and instructor approval; 19 in Reading on the ACT; 3.0 GPA",
    "Counseling Notes": "This course can be taken for dual enrollment credit through RSCC. Students should apply for the dual enrollment grant for both fall and spring, enrolling in one 3-credit course per term for a total of 6 hours. Students who complete this course as juniors or are enrolled in this course as seniors may apply to work in local businesses for additional work-experience course credit (one or two additional credits) during their senior year. See Work-Based Learning."
  },
  "605030": {
    "name": "Marketing and Management",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Marketing and Management I: Principles focuses on the study of marketing concepts and their practical applications. Students will examine the risks and challenges that marketers face to establish a competitive edge in the sale of products and services. Topics covered include foundational marketing functions such as promotion, distribution, and selling, as well as coverage of economics fundamentals, international marketing, and career development. Upon completion of this course, proficient students will understand the economic principles, the marketing mix, and product development and selling strategies.",
    "Prerequisites": "Computer Applications A or Introduction to Business and Marketing",
    "Counseling Notes": "Students who complete this course as juniors or are enrolled in this course as seniors may apply to work in local businesses for additional work-experience course credit (one or two additional credits) during their senior year. See Work-Based Learning. Successful completion of Marketing and Management meets the .5 credit graduation requirement for Economics and a credit toward a Business Academy area of focus simultaneously."
  },
  "605934": {
    "name": "Entrepreneurship",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Entrepreneurship is an applied knowledge course that begins with the discovery process of generating new business ideas. Students research local, national, and international social and economic trends and analyze the feasibility of their own proposed businesses, both from a market demand and revenue-producing standpoint. Based on their entrepreneurial endeavors, students will prepare, write, and revise a business plan. In preparation for the business plan, students will conduct market research, study ownership structures, evaluate risks, examine startup costs, determine essential vendors, and identify sources of capital and financing options. Students will also draft, refine, and rehearse entrepreneurship pitches developed from their business plans to present during course intervals and to give final presentations at the conclusion of the course. Upon conclusion of this course, proficient students will be able to articulate, and defend, elements of a full business plan for a new business.",
    "Prerequisites": "Computer Applications A or Introduction to Business and Marketing",
    "Counseling Notes": "Students who complete this course as juniors or are enrolled in this course as seniors may apply to work in local businesses for additional work-experience course credit (one or two additional credits) during their senior year. See Work-Based Learning. Successful completion of Marketing and Management meets the .5 credit graduation requirement for Economics and a credit toward a Business Academy area of focus simultaneously."
  },
  "603798": {
    "name": "Work-Based Learning",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Student must have completed an additional Business Academy course during the junior year or be enrolled in the course as a senior. Work-Based Learning (Work-Based Learning: Career Practicum) is a capstone course intended to provide students with opportunities to apply the skills and knowledge learned in previous Business Academy and general education courses within a professional work environment. The course allows students to earn high school credit for select models of work-based learning, which allow students to interact with the industry professionals in order to extend and deepen classroom work and support the development of postsecondary and career readiness knowledge and skills. Through Work-Based Learning, students participate in individual work-based learning experiences in professional settings when they meet the hours required for fulltime course equivalent. Upon completion of the Work-Based Learning experience, students will be prepared for postsecondary and career opportunities aligned with their interests and demonstrate professional-quality employability skills relevant to their chosen career paths. Students will participate in class instruction during 8th period every day for approximately the first three weeks of school and will continue once a month on the first Wednesday of each month for the remainder of the year. (Due to the school calendar, some meetings may potentially be rescheduled throughout the year). Both the classroom performance and the WBL on-the-job component are to be evaluated in determining a student’s composite grade. Students must maintain 90% attendance both in school and at work. Please note that students who participate in the work-based learning program may be subject to alcohol and/or drug testing by the third-party organization/employer.  The third-party organization/employer may require parental consent to conduct the testing depending on the student’s age.",
    "Prerequisites": "Computer Applications A or Introduction to Business and Marketing and at least one additional Business Academy course",
    "Counseling Notes": "Students must complete an online application for this program at registration time during their junior year. Candidates must be approved by Student Services before being allowed to interview. Business employers will interview and hire the student(s) of their choice."
  },
  "603757": {
    "name": "Virtual Enterprises, International TM",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Virtual Enterprises, International™ (VE) is a simulated business environment. The VE students will be involved in actual on-the-job work experiences including accounting, personnel, administration, management, and marketing. The only difference between the VE company and an actual business is that no material goods are produced or legal tender exchanged; however, services will be provided. Working in a team, the student will develop and enhance oral and written communication skills through initiative, responsibility, and creativity. The VE experience will weave together several academic disciplines and occupational subjects, thereby overcoming fragmentation of subjects. The course will link learning to application and real-life experiences. The goal is to create a learning environment that, through a series of activities, integrates school and workplace to enhance learning. Laboratory facilities and experiences simulate those found in business and industry. The VE course includes the creation/operation of a virtual business. This practice company will design, produce and market a virtual product to other practice companies via the Internet. Students in the Business Academy will come together to utilize and combine their skills and expertise in the business environment. Students will use a variety of software.",
    "Prerequisites": "Computer Applications A or Introduction to Business and Marketing and completion of an additional Business Academy Course (Exception: Current sophomores or juniors in Accounting I CP may apply for VE.)",
    "Counseling Notes": "Students must complete an application for this program at registration time during their junior year. Candidates will participate in a formal job interview as a part of the selection process. Students enrolled in this course as seniors may apply to work in local businesses for work "
  },
  "605650": {
    "name": "Early Childhood Education Careers 1",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Careers in early childhood education include but are not limited to childcare providers, nannies, and preschool teachers. This course studies the foundation of childhood development services, careers, provider responsibilities and aptitudes, and fundamentals of child development. Students will create a course portfolio.",
    "Prerequisites": "Completion of application, interview by instructor, and instructor",
    "Counseling Notes": "recommendationRequirements: Complete an Early Childhood Education Application (available in the  Guidance Office and Early Childhood Education Classroom CS-250) and submit two letters of recommendation. Interviews will be conducted with each student. Applicants must have good attendance, discipline, and academic records. Students need to be focusing on a future career with young children and eager to work one-on-one with preschoolers."
  },
  "605660": {
    "name": "Early Childhood Education Careers 2",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "This is a course for students interested in learning more about becoming an early childhood teacher, nanny, or childcare provider. This course covers the components of curriculum planning, learning, screening and assessing, special populations, and educational technology. Students in this course will observe educators in action, practice specific skills, and add personal work products to a course portfolio.",
    "Prerequisites": "Early Childhood Education Careers 1 and instructor recommendation",
    "Counseling Notes": "Applicants must have good attendance, discipline, and academic records. Students need to be focusing on a future career with young children and eager to work one-on-one with"
  },
  "605661": {
    "name": "DE Early Childhood Education Careers 3",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Year-long on a block"],
    "Description": "This is an applied knowledge course for students interested in learning more about becoming an early childhood teacher, nanny, or childcare provider. This course encompasses the components of the learning environment, planning age appropriate activities, using activities for learning, and developing communication skills. Students in this course will participate in a work-based learning component of instruction and add work products to a course portfolio.",
    "Prerequisites": "Early Childhood Education Careers 2 and instructor signature; dual enrollment application and instructor recommendation",
    "Counseling Notes": "Applicants must have good attendance, discipline, and academic records. Students need to be focusing on a future career with young children and eager to work one-on- one with preschoolers. *This course meets all year during the 3rd period lunch block.  Therefore, students will have a 55-minute lunch period during 4th block and then a 35-minute period as a teacher aide during 4th block.  Therefore, this course is a co-requisite of 4th block lunch and 4th block Service Learning."
  },
  "605698": {
    "name": "Early Childhood Education Careers Work- Based Learning/Student Teacher",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "This is an applied knowledge course for students interested in learning more about becoming an early childhood teacher, nanny, or childcare provider. The course standards cover understanding the components professionalism, policies, regulation, and teaching to learn principles. Students in this course will participate in a work-based learning component of instruction and add work products to a course portfolio. Work-Based Learning (WBL) activities are part of a structured system, open to students that have completed ECEC II. Only juniors or seniors (16 years or older) may participate. WBL activities allow students to apply classroom theories and explore career options at the work site, as well as connect classroom learning to work. Students will be placed in work sites that focus on a career interest. Examples include: Oak Ridge Schools – preschool, elementary, middle schools. Please note that students who participate in the work-based learning program may be subject to alcohol and/or drug testing by the third-party organization/employer.  The third-party organization/employer may require parental consent to conduct the testing depending on the student’s age.",
    "Prerequisites": "DE Early Childhood Education Careers 3",
    "Counseling Notes": "None"
  },
  "913331": {
    "name": "NJROTC I CP",
    "GPA": "4.0",
    "Credits": ["1.0", "1.0"],
    "Subject": ["Career Academies", "Wellness"],
    "Length": ["Semester"],
    "Description": "Naval Science 1 introduces the historical, political and economic impact of the Navy on the American Nation, and outlines the principles of citizenship, leadership and the basics of the historical documents and organization of our national government and its defense structure.",
    "Prerequisites": "None",
    "Counseling Notes": "Two (2) full credits of NJROTC fulfill the Wellness B and Wellness C graduation requirements in addition to fulfilling two credits toward an Area of Focus."
  },
  "923332": {
    "name": "NJROTC II CP",
    "GPA": "4.0",
    "Credits": ["1.0", "1.0"],
    "Subject": ["Career Academies", "Wellness"],
    "Length": ["Semester"],
    "Description": "Naval Science 2 emphasizes the historical, political and economic impact of the Navy on the American Nation and the basics of science relevant to the Navy and intends to help Cadets: (a) Establish commendable citizenship standards, high leadership goals, good study habits and a sense of moral responsibility. (b)Learn more about the history, organization and profession of the Navy. (c) Gain a deeper awareness of the vital importance of the world ocean to the continued well-being of the United States and her citizens – economically, politically, militarily and environmentally. (d) Firmly establish a sound appreciation for the various sciences (e) introduce the importance of astronomy, communications technology, meteorology, electronics and logistics to the Navy and naval science.",
    "Prerequisites": "NJROTC I",
    "Counseling Notes": "Two (2) full credits of NJROTC fulfill the Wellness B and Wellness C graduation requirements in addition to fulfilling two credits toward an Area of Focus."
  },
  "933333": {
    "name": "NJROTC  III CP",
    "GPA": "4.0",
    "Credits": ["1.0", "1.0"],
    "Subject": ["Career Academies", "Wellness"],
    "Length": ["Semester"],
    "Description": "Naval Science 3 expands understanding of the historical, political and economic impact of the Navy on the American Nation and intends to help Cadets: (a) Deepen knowledge of and appreciation for the organization and profession of the Navy. (b) Gain an understanding of the basic concepts of military justice, international and maritime law, sea power and national security. (c) Introduce practical naval and maritime skills to students and demonstrate how these skills can be applied in a variety of leadership situations.",
    "Prerequisites": "NJROTC II",
    "Counseling Notes": "Two (2) full credits of NJROTC fulfill the Wellness B and Wellness C graduation requirements in addition to fulfilling two credits toward an Area of Focus.  Successful completion of 3 credits of JROTC substitutes for ½ credit of Personal Finance and ½ credit of U.S. Government."
  },
  "943334": {
    "name": "NJROTC IV CP",
    "GPA": "4.0",
    "Credits": ["1.0", "1.0"],
    "Subject": ["Career Academies", "Wellness"],
    "Length": ["Semester"],
    "Description": "Naval Science 4 broadens a cadet’s understanding of leadership as a key component in a Navy career and its impact on American citizenship. (a) Learn leadership responsibilities through opportunities within the NJROTC unit. (b) Provide professionally guided independent study on leadership and citizenship. (c) Use selected readings in Naval Leadership resources to broaden understanding of the basic theory of leadership, details of responsibilities of leadership and qualities that outstanding leader’s exhibit.",
    "Prerequisites": "NJROTC III",
    "Counseling Notes": "Two (2) full credits of NJROTC fulfill the Wellness B and Wellness C graduation requirements in addition to fulfilling two credits toward an Area of Focus.  Successful completion of 3 years of JROTC substitutes for ½ credit of Personal Finance and ½ credit of U.S. Government."
  },
  "953334": {
    "name": "NJROTC V CP",
    "GPA": "4.0",
    "Credits": ["1.0", "1.0"],
    "Subject": ["Career Academies", "Wellness"],
    "Length": ["Semester"],
    "Description": "Naval Science 5 broadens a cadet’s understanding of leadership as a key component in a Navy career and its impact on American citizenship. (a) Learn leadership responsibilities through opportunities within the NJROTC unit. (b) Provide professionally guided independent study on leadership and citizenship. (c) Use selected readings in Naval Leadership resources to broaden understanding of the basic theory of leadership, details of responsibilities of leadership and qualities that outstanding leader’s exhibit.",
    "Prerequisites": "NJROTC IV",
    "Counseling Notes": "Two (2) full credits of NJROTC fulfill the Wellness B and Wellness C graduation requirements in addition to fulfilling two credits toward an Area of Focus.  Successful completion of 3 years of JROTC substitutes for ½ credit of Personal Finance and ½ credit of U.S. Government."
  },
  "963334": {
    "name": "NJROTC VI CP",
    "GPA": "4.0",
    "Credits": ["1.0", "1.0"],
    "Subject": ["Career Academies", "Wellness"],
    "Length": ["Semester"],
    "Description": "Naval Science 6 broadens a cadet’s understanding of leadership as a key component in a Navy career and its impact on American citizenship. (a) Learn leadership responsibilities through opportunities within the NJROTC unit. (b) Provide professionally guided independent study on leadership and citizenship. (c) Use selected readings in Naval Leadership resources to broaden understanding of the basic theory of leadership, details of responsibilities of leadership and qualities that outstanding leader’s exhibit.",
    "Prerequisites": "NJROTC V",
    "Counseling Notes": "Two (2) full credits of NJROTC fulfill the Wellness B and Wellness C graduation requirements in addition to fulfilling two credits toward an Area of Focus.  Successful completion of 3 years of JROTC substitutes for ½ credit of Personal Finance and ½ credit of U.S. Government."
  },
  "605504": {
    "name": "Health Science Education",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Health Science Education is an introductory course designed to prepare students to pursue careers in the fields of public health, therapeutics, health services administration, diagnostics, and support services. Upon completion of this course, a proficient student will be able to identify careers in these fields, compare the features of healthcare systems, explain the legal and ethical ramifications of the healthcare setting, and begin to perform foundational healthcare skills. This course will serve as a strong foundation for all the Health Science programs of study as well as the Health Services Administration program of study. This is the foundational course in all programs of study in the Health Science career cluster. It is also an option for the first course in the Health Services Administration program of study in the Business cluster. For more information on the benefits and requirements of implementing these programs in full, please visit the Health Science website.",
    "Prerequisites": "None",
    "Counseling Notes": "None"
  },
  "605506": {
    "name": "Medical Therapeutics",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Medical Therapeutics is an applied course designed to prepare students to pursue careers in therapeutic services, this could include careers such as dental, medical assistance, nursing, pharmacy, respiratory, social work, nutritionist, physician, psychologist, veterinarian and others. Upon completion of this course, a proficient student will be able to identify careers in therapeutics services; assess, monitor, evaluate, and report patient/client health status; and identify the purpose and components of treatments.",
    "Prerequisites": "None",
    "Counseling Notes": "This course does not have prerequisites but serves to prepare students to be clinical interns and/or for the Dual Enrollment Nursing Education course."
  },
  "605511": {
    "name": "DE Clinical Services",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "First semester – medical terminology (RSCC Medical Terminology HIMT 1300 dual enrollment – 3 college credits.) Medical Terminology is a course designed to provide students with the opportunity to develop working knowledge of the language of healthcare professionals. Students will acquire vocabulary building and problem solving skills by learning prefixes, suffixes, roots, combining forms, and abbreviations commonly used in medical fields. Utilizing a body systems approach, students will define, interpret, and pronounce medical terms relating to structure and function, pathology, diagnosis, clinical procedures, and pharmacology. Upon completion of this course, proficient students will be able to apply problem-solving skills to the documentation of medical phenomena and will be able to communicate fluently in the language of medicine when working in healthcare settings.  Cost: none.",
    "Prerequisites": "Medical Therapeutics and/or Rehabilitation Careers with a minimum 80% grade average.",
    "Counseling Notes": "Must register for both semesters, classes will meet 1st and 2nd periods. Enrollment limited to 15 students. Progression into the clinical internship practicum component second semester is also contingent upon continual attainment of the Health Science Academy clinical internship quality indicators during the first semester course."
  },
  "605501 606133": {
    "name": "Clinical Internship Honors-Pharmacy Tech",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Second Semester – Clinical Internship/elective course: Students may choose to complete a clinical internship after completing Medical Therapeutics and/or Rehabilitation Careers. The internships are designed to be completed in a hospital, long term care facility, rehab center, medical office, or other health care facility. During the internship, student may also enroll in elective course listed below. COSTS: Clinical Internship embroidered uniform, physical exam/TB test, immunizations, CPR Certification. Elective course Pharmacological Sciences (pharmacy technician certification training) 1 credit; 12th only.",
    "Prerequisites": "http://tn.gov/education/article/cte-cluster-health-science",
    "Counseling Notes": "Medical Therapeutics and/or Rehabilitation Careers with a minimum 80% grade average. Student application, instructor/advisory board approval"
  },
  "606000": {
    "name": "Dual Enrollment Nursing Education",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Offered from Tennessee College of Applied Technology on Oak Ridge Schools Campus. Nursing Education consists of 18 units of study dealing with direct bedside nursing care. Students can be registered by the Tennessee",
    "Prerequisites": "http://tn.gov/education/article/cte-cluster-health-science",
    "Counseling Notes": "Medical Therapeutics; 2.5 GPA"
  },
  "313625": {
    "name": "Coding A L",
    "GPA": "4.0",
    "Credits": ["0.5"],
    "Subject": ["Career Academies"],
    "Length": ["Year-long skinny at lunch"],
    "Description": "This course is an introduction to coding concepts such as conditions, loops, functions, and objects. The concepts will be learned by building computer programs and games. Emphasis will be given to problem solving through structured program development.",
    "Prerequisites": "Open to any student",
    "Counseling Notes": "This course cannot be used as a graduation requirement in mathematics, but it can be used toward an Information Technology or Math and Science area of focus.  This course meets during the lunch period"
  },
  "313632": {
    "name": "Coding B L",
    "GPA": "4.0",
    "Credits": ["0.5"],
    "Subject": ["Career Academies"],
    "Length": ["Year-long skinny at lunch"],
    "Description": "This course is a continuation of Coding A, but is flexible enough to accommodate students who did not take Coding B or who have no programming experience.",
    "Prerequisites": "Open to any student",
    "Counseling Notes": "This course cannot be used as a graduation requirement in mathematics, but it can be used toward an Information Technology or Math and Science area of focus.  This class meets during the lunch period."
  },
  "313626": {
    "name": "Coding I",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "This course is an introduction to coding concepts such as conditions, loops, functions, and objects. The concepts will be learned by building computer programs and games. Emphasis will be given to problem solving through structured program development.",
    "Prerequisites": "Open to any student",
    "Counseling Notes": "This course cannot be used as a graduation requirement in mathematics, but it can be used toward an Information Technology or Math and Science area of focus."
  },
  "313620": {
    "name": "Cybersecurity I",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Cybersecurity I is a course intended to teach students the basic concepts of cybersecurity. The course places an emphasis on security integration, application of cybersecurity practices and devices, ethics, and best practices management. The fundamental skills in this course cover both in house and external threats to network security and design, how to enforce network level security policies, and how to safeguard an organization’s information. Upon completion of this course, proficient students will be demonstrate and understanding of cybersecurity concepts, identify fundamental principles of networking systems, understand network infrastructure and network security, and be able to demonstrate h ",
    "Prerequisites": "Open to any student who has successfully completed Algebra1 with an A or B.",
    "Counseling Notes": "This course cannot be used as a graduation requirement in mathematics, but it can be used toward an Information Technology or Math and Science area of focus."
  },
  "323635": {
    "name": "AP Computer Science Principles",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "AP Computer Science Principles focuses on foundational computing skills to help students understand the relevance of those computing skills to their college and career plans. Multidisciplinary in nature, this course teaches students how to analyze problems, use creative thinking, and create computational artifacts including programs. Throughout the course, students will collaborate to investigate real-world issues using computing. The course focuses on seven major ideas in computing: Creativity, Abstraction, Data and Information, Algorithms,",
    "Prerequisites": "http://www.ortn.edu/central-office/teaching-and-learning/curriculum/high-school",
    "Counseling Notes": "Open to any student who has successfully completed Algebra1 with an A or B."
  },
  "313635": {
    "name": "AP Computer Science A",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Students will follow the Advanced Placement Computer Science curriculum outline. AP booklets with a detailed course description are available through the AP Computer Science teacher or the Guidance Office. The major emphasis of this course is on programming methodology, algorithms, and data structures using JAVA. Applications are used to develop student awareness of the need for particular algorithms and data structures, as well as to provide topics for programming assignments to which the students can apply their knowledge. Treatments of computer systems and social implications of computing are integrated into the course work and not isolated as separate units. AP computer science options include both AP Computer Science A (G02H45) and AP Computer Science Principles (G02H44). Both courses can substitute for 4th year math if the student has reached the mathematics college readiness benchmark of 22 on the ACT.",
    "Prerequisites": "Open to any student who has at least one semester of programming experience or has successfully completed Algebra 2.",
    "Counseling Notes": "Students may use this course to satisfy the requirement of being enrolled in a 4th mathematics course as long as they have already earned credits in the three State Board of Education required math courses for graduation and a 22 on the math portion of the ACT."
  },
  "600303": {
    "name": "Foundations of Technology",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Foundations of Technology prepares students to understand and apply technological concepts and processes that are the cornerstone for the high school technology program. Group and individual activities engage students in creating ideas, developing innovations, and engineering practical solutions. Technology content, resources, and laboratory/classroom activities apply student applications of science, mathematics, and other school subjects in authentic situations.",
    "Prerequisites": "None.",
    "Counseling Notes": "This is an introductory course to the Engineering by Design STEM pathway. Students who wish to pursue CCTE concentrator status must take 3 courses in a single pathway. Certifications: AutoDESK Inventor, Fusion 360, and Revit OSHA-10, Snap-on Precision Measurement Instruments (PMI)"
  },
  "600302": {
    "name": "Technological Design",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "In Technological Design, engineering scope, content, and professional practices are presented through practical applications. Students in engineering teams apply technology, science, and mathematics concepts and skills to solve engineering design problems and innovate designs. Students research, develop, test, and analyze engineering designs using criteria such as design effectiveness, public safety, human factors, and ethics.",
    "Prerequisites": "None.",
    "Counseling Notes": "This is the second course in the Engineering by Design STEM pathway. Students who wish to pursue CCTE concentrator status must take 3 courses in a single pathway. Certifications: AutoDESK Inventor, Fusion 360, and Revit OSHA-10, Snap-on Precision Measurement Instruments (PMI)"
  },
  "600304": {
    "name": "DE Advanced STEM Applications",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Advanced Technological Applications is a course in which students study components of the designed world. Units include: Engineering Design, Graphics and Spatial Skills, in which students develop the ability to communicate different information of technical drawings and display and understanding of geometric construction. Cybersecurity, in which students learn how we manage our lives digitally from banking and paying bills to online shopping and completing applications, recognizing that personal and company information needs to be kept secure. It is important that students understand cybersecurity to keep their digital lives safe and spot cyber scams. Biotechnology, which has become entrenched in our daily lives in ways that we do not even realize. As our understanding of the applicability of biotechnology grows, we further explore solutions to resolve technological constraints that once inhibited our society’s advancement. Information Technology, modeling and prediction based on visualization of data and testing design involves changing inputs on the fly to see the effects on the outcomes; and Robotics, in which students learn how robotics and automation technologies have a significant impact on our daily lives. From temperature controls in our homes to high tech manufacturing to agricultural applications, automating inputs, processes and outputs has the potential to make our lives easier, safer and more interesting. Students are engaged in context rich applications such as home automation, agricultural crop harvest, prosthetics and self-driving cars. Engineering Design focuses on how engineers apply their creativity, resourcefulness, mathematical, scientific, and technical knowledge and skills in the creation or refinement of technological products/systems. A key approach will be the employment of a sophisticated, sequential, and iterative design and development process to solve authentic engineering tasks/problems. Units include Fundamentals of Design Engineering, Elements of Design, Structural Design/Modeling/Prototyping/Protecting Ideas, Product and Systems Engineering, and Analysis Management.",
    "Prerequisites": "None.",
    "Counseling Notes": "This is the third and fourth course in the Engineering by Design STEM pathway. Students who wish to pursue CCTE concentrator status must take 3 courses in a single pathway."
  },
  "606089": {
    "name": "DE Robotics",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "DE Robotics is an advanced course in the STEM career cluster for students interested in learning more about careers in engineering that include pneumatic, electro pneumatic, and hydraulic control circuits in complex systems. Upon completion of this course, proficient students will be able to explain the inter-relationships of components and modules within a complex robotics system. They will understand the differences between hydraulic and pneumatic fluid power and can explain the scientific principles that apply. They will troubleshoot and demonstrate continuous improvement models for iterative prototyping. This course explores modern materials and manufacturing methods, incorporating finance, ethics, and engineering design. The integrated approach teaches students to improve many facets of engineering design including safety, quality, and efficiency. Students will analyze, design, and build robotics systems. While implementing these designs, students will continually hone their interpersonal skills, creative abilities, and understanding of the design process.",
    "Prerequisites": "None.",
    "Counseling Notes": "This course may be repeated for multiple Dual Enrollment credits. It aligns with FIRST Robotics competition and provides students with programming experience and build time inside the school day. Students who wish to pursue CCTE concentrator status must take 3 courses in a single pathway.  This course must be taken for Dual Enrollment credit with RSCC. Only Juniors and Seniors are eligible for the Dual Enrollment Grant.   Certification: LabVIEW. AutoDESK, SolidWorks, and/or Siemens Level I"
  },
  "605880": {
    "name": "Automotive and Aviation I",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "A primary focus of this coursework is to allow students to explore career opportunities and requirements of professional transportation occupations, including automotive and aviation. In addition to acquiring foundational knowledge of safety procedures and industry regulations, students will gain essential understanding of automotive and aircraft structures, transportation logistics, basic procedures, and navigation. Upon completion of this course sequence, proficient students will be prepared for both maintaining personal automobile and other small engines, to further study in advanced automotive/aviation maintenance and/or aviation flight courses in postsecondary institutions.",
    "Prerequisites": "None",
    "Counseling Notes": "Students will need to purchase coveralls, safety glasses, mechanics gloves, and steeltoed boots"
  },
  "605881": {
    "name": "Automotive and Aviation II",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "A primary focus of this coursework is to allow students to explore career opportunities and requirements of professional transportation occupations, including automotive and aviation. In addition to acquiring foundational knowledge of safety procedures and industry regulations, students will gain essential understanding of automotive and aircraft structures, transportation logistics, basic procedures, and navigation. Upon completion of this course sequence, proficient students will be prepared for both maintaining personal automobile and other small engines, to further study in advanced automotive/aviation maintenance and/or aviation flight courses in postsecondary institutions.",
    "Prerequisites": "Automotive and Aviation I",
    "Counseling Notes": "Students will need to purchase coveralls, safety glasses, mechanics gloves, and steel-"
  },
  "615880 615881 615882 615883": {
    "name": "DE Automotive and Aviation I, II, III, or IV",
    "GPA": "5.0",
    "Credits": ["2.0"],
    "Subject": ["Career Academies"],
    "Length": ["Semester"],
    "Description": "Dual enrollment students learn to service suspension and steering systems and brake systems. Upon completing the automotive and aviation sequence of courses, students may earn certification an ASE Certified Maintenance and Light Repair Technician, Snap-On Precision Measurement Instruments certification, and/or FAA Part 107 UAS drone pilot certification. Hours earned in the Maintenance and Light Repair courses may be used toward meeting National Automotive Technicians Education Foundation (NATEF) standards and Tennessee Department of Education standards. NATEF requires that 95% of the P-1 tasks, 80% of the P-2 tasks, and 50% of the P-3 tasks will be accomplished. These tasks are notated in these standards.",
    "Prerequisites": "None",
    "Counseling Notes": "Because dual enrollment with Tennessee Colleges of Applied Technology in Knoxville is an integral part of this course sequence, students must be in 11th and 12th grades to qualify for the dual enrollment grant that pays the tuition. Students must maintain a B average in their TCAT-K coursework to remain eligible for the grant.  Students will need to purchase coveralls, safety glasses, mechanics gloves, and steel-toed boots."
  },
  "743407": {
    "name": "United States Government CP",
    "GPA": "4.0",
    "Credits": ["0.5"],
    "Subject": ["Social Studies"],
    "Length": ["Term"],
    "Description": "Government is designed to provide students with a practical study of the functions and workings of the United States Government. Students will examine important governmental issues including: the rights and responsibilities of citizenship, the need for active citizen participation, immigration and naturalization, the roots of American democracy, the structure and function of the United Sates Constitution, and the workings of the legislative, executive, and judicial branches of government. There will also be an emphasis placed upon current events to ensure that students are familiar with important global and domestic issues.",
    "Prerequisites": "None",
    "Counseling Notes": " Students who register for this course must select another term course to partner with this one."
  },
  "703446": {
    "name": "AP United States Government & Politics Combined Studies",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Social Studies"],
    "Length": ["Year-long skinny on a block*"],
    "Description": "The Advanced Placement course in United States Government and Politics is a year-long course designed to give students a critical perspective on politics and government. This course involves both the study of general concepts used to interpret U. S. politics and an examination of the various institutions, groups, beliefs, and ideas that make up the American political system. Students will develop understanding of the typical patterns of political processes and behavior and apply reasoning to assess the causes and consequences of political events. Students will examine, analyze, and interpret basic data relevant to U.S. government and politics. This class will meet the State graduation requirement for one-half credit in U.S. government and prepare the student for the AP examination in United States Government and Politics. Depending on the score received on the AP examination, students can receive college credits; therefore, the course is taught with college-level textbooks and rigor.",
    "Prerequisites": "Teacher Recommendation",
    "Counseling Notes": "All students are expected to take the AP exam. Students will receive .5 credit in AP US Government and .5 credit in Personal Finance CP. *This course is taken in conjunction with English 9 Honors Combined Studies.  It will meet all year for ½ of a block period."
  },
  "703496": {
    "name": "Personal Finance",
    "Credits": ["1.0"],
    "Subject": ["Social Studies"]
  },
  "713401 ": {
    "name": "World History and Geography CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Social Studies"],
    "Length": ["Semester"],
    "Description": "This is a college preparatory course designed to give the student an understanding of the development of civilizations in Asia, Africa, Europe, and the Americas. Content includes selected histories of these areas from earliest times to the present. In addition, political, economic, and cultural interdependence will be emphasized, along with the study of art, architecture, philosophies, and major historical concepts. The course will incorporate geography to enable the student to see, understand, and appreciate the web of relationships between people, places, and environments.",
    "Prerequisites": "None",
    "Counseling Notes": "This course should be taken in the 10th grade; however, some students may opt to take it in the 12th grade."
  },
  "723449": {
    "name": "AP World History Combined Studies",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Social Studies"],
    "Length": ["Year-long skinny on a block*"],
    "Description": "The history component of Combined Studies is a team-taught Advanced Placement course for sophomores and students enrolled in the course must also take the English component. An enriched AP World History curriculum is correlated to the world literature presented in the English component to establish an understanding of world cultures that is a necessary foundation for success in future AP courses in both departments. Critical thinking skills and analytical strategies are also emphasized to improve content retention and to enhance writing skills.",
    "Prerequisites": "Teacher recommendation",
    "Counseling Notes": "* This course is a co-requisite of English 10 Honors CS.  It will meet all year for ½ of a block period."
  },
  "703445": {
    "name": "AP United States Government & Politics (with personal finance)",
    "GPA": "5.0",
    "Credits": ["1"],
    "Subject": ["Social Studies"],
    "Length": ["Semester"],
    "Description": "The Advanced Placement course in United States Government and Politics is a year-long course designed to give students a critical perspective on politics and government. This course involves both the study of general concepts used to interpret U. S. politics and an examination of the various institutions, groups, beliefs, and ideas that make up the American political system. Students will develop understanding of the typical patterns of political processes and behavior and apply reasoning to assess the causes and consequences of political events. Students will examine, analyze, and interpret basic data relevant to U.S. government and politics. This class will meet the State graduation requirement for one-half credit in U.S. government and prepare the student for the AP examination in United States Government and Politics. Depending on the score received on the AP examination, students can receive college credits; therefore, the course is taught with college-level textbooks and rigor.",
    "Prerequisites": "Teacher Recommendation",
    "Counseling Notes": "All students are expected to take the AP exam. Students will receive .5 credit in AP US Government and .5 credit in Personal Finance CP"
  },
  "713405": {
    "name": "United States History CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Social Studies"],
    "Length": ["Semester"],
    "Description": "This course quickly surveys the Age of Discovery, colonization, colonial, and Revolutionary periods. It continues with major emphasis given to the study of America from the Constitution to the present. Background of the nation's current problems and values will be included. The course incorporates geography to recognize the impact of U.S. development on people, places, and historical events. Use of source material in addition to the textbook will be at the discretion of the teacher. Students are required to take the TN Ready Assessment for U.S. History with the exam score figured as a part of the student’s final grade in the course.",
    "Prerequisites": "None",
    "Counseling Notes": "None"
  },
  "723440": {
    "name": "AP United States History",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Social Studies"],
    "Length": ["Semester"],
    "Description": "The AP U.S. History course develops students’ understanding of American history from approximately 1491 to the present. Students will investigate U.S. history for significant events, individuals, developments, and processes across historical periods. Students will develop the same thinking skills and methods used by historians:  analysis of primary and secondary sources, contextualization, comparison, causation, continuity and change over time, and argumentation. The course also looks at seven themes:  American and national identity; politics and power; work, exchange, and technology; culture and society; migration and settlement; geography and the environment; and America in the world. Students will explore these themes in order to make connections among historical developments in different times and places in preparation for the AP U. S. History Exam and/or future college-level history courses.",
    "Prerequisites": "Most students in the course have a 3.0 or better grade point average at the end of their sophomore year. A college textbook will be used and students are required to complete historical outlines, research projects, and supplementary readings. Strong reading and writing skills are required.",
    "Counseling Notes": "None"
  },
  "723439": {
    "name": "AP United States History Combined Studies",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Social Studies"],
    "Length": ["Year-long on a skinny*"],
    "Description": "The AP U.S. History course develops students’ understanding of American history from approximately 1491 to the present. Students will investigate U.S. history for significant events, individuals, developments, and processes across historical periods. Students will develop the same thinking skills and methods used by historians:  analysis of primary and secondary sources, contextualization, comparison, causation, continuity and change over time, and argumentation. The course also looks at seven themes:  American and national identity; politics and power; work, exchange, and technology; culture and society; migration and settlement; geography and the environment; and America in the world. Students will explore these themes in order to make connections among historical developments in different times and places in preparation for the AP U. S. History Exam and/or future college-level history courses.",
    "Prerequisites": "Most students in the course have a 3.0 or better grade point average at the end of their sophomore year. A college textbook will be used and students are required to complete historical outlines, research projects, and supplementary readings. Strong reading and writing skills are required.",
    "Counseling Notes": "  *This course is a co-requisite with AP English Language and Composition Combined Studies.  It will meet all year for ½ of a block period."
  },
  "743496": {
    "name": "Personal Finance CP",
    "GPA": "4.0",
    "Credits": ["0.5"],
    "Subject": ["Social Studies"],
    "Length": ["Term"],
    "Description": "Personal Finance is designed to provide students with a practical study of how individual choices directly influence occupational goals and future earnings potential. Real world topics covered will include income, money management, spending and credit, as well as saving and investing. Students will design personal and household budgets, simulate use of checking and savings accounts, demonstrate knowledge of finance, debt, and credit management, and evaluate and understand insurance and taxes. There will also be an emphasis placed upon current events to ensure that students are familiar with important global and domestic economic",
    "Prerequisites": "None",
    "Counseling Notes": "This course is usually taken in conjunction with economics in the senior year.  Students who register for this course must select another term course to partner with this one. This course is not available for 9th or 10th graders in 2021-22."
  },
  "713431": {
    "name": "Economics CP",
    "GPA": "4.0",
    "Credits": ["0.5"],
    "Subject": ["Social Studies"],
    "Length": ["Term"],
    "Description": "This course is a study of the market economy and the free enterprise system. Emphasis will be placed on the role of government and the individual in the system. Economic systems, supply and demand, business cycles, money and banking, labor, government intervention in the economy, and international economics are some of the topics that are covered. Lecture, small group work, stock market simulations, and various projects will be used to master the United States economic system.",
    "Prerequisites": "None",
    "Counseling Notes": " This course is usually taken in conjunction with Personal Finance in the senior year.  Students who register for this course must select another term course to partner with this one."
  },
  "723443": {
    "name": "AP Microeconomics",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Social Studies"],
    "Length": ["Semester"],
    "Description": "AP Microeconomics allows the student an opportunity to experience a college-level course and earn 3 hours of college credit while fulfilling the graduation requirement for economics instruction at ORHS. Micro examines the basic concepts of economics, supply and demand issues, marginal benefit analysis, and market structures. The student will build a stock market portfolio, create a business, and apply many microeconomic concepts into current economic conditions. AP Macroeconomics is a study of our world today and an examination of current economic issues.  This course is for the student who is interested in the political system, environmental concerns, the financial power of our government and the Federal Reserve System. Students will examine the role of government, the Federal Reserve System, the Stock Market, global economics, and the decisions of the all- important consumer. Current economic events and economic indicators are analyzed and applied to master the theory of Macroeconomics. Students are expected to take the AP Microeconomics and the AP Macroeconomics exams.",
    "Prerequisites": "This class will be taken with Macroeconomics in one semester.",
    "Counseling Notes": "This class will meet the State graduation requirement for economics and prepare the student for the Micro section of the AP Economics Exam. This course is designed for the accelerated student whose reading, writing, and thinking skills are well developed. Students who earn a 3, 4, or 5 on both AP Exams may earn the equivalent of 6 hours of credit for Economics 211 at UT Knoxville."
  },
  "723444": {
    "name": "AP Macroeconomics",
    "Credits": ["1.0"],
    "Subject": ["Social Studies"]
  },
  "723441": {
    "name": "AP European History",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Social Studies"],
    "Length": ["Semester"],
    "Description": "AP European History focuses on developing students’ abilities to think conceptually about European history from approximately 1450 to the present and apply historical thinking skills as they learn about the past. The development of modern Europe is addressed through the social, political, religious, intellectual, technological, and economic histories of the various peoples and nations of Europe and their interactions with the wider world. In addition to the reading, writing, and discussion activities characteristic of an AP humanities course, students will have opportunities to explore areas of particular interest through projects of their own design to connect European history to their other areas of academic and cultural interest. This course is designed to be the equivalent of a two-semester introductory college or university European history course and will prepare students for the AP exam.",
    "Prerequisites": "None",
    "Counseling Notes": "Students taking this course will be prepared to take the AP Exam and should have above average reading level. They may earn 3 hours of college credit by successfully completing the AP Exam. This course will satisfy the graduation requirement for World History and Geography. All students are expected to take the AP Exam."
  },
  "703450": {
    "name": "AP Human Geography",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Social Studies"],
    "Length": ["Semester"],
    "Description": "AP Human Geography is a year-long course designed for students who are enrolled in Senior English classes. This college-level introductory course will study patterns and processes that have shaped human understanding, use, and alteration of Earth’s surface. This course uses spatial concepts and analysis of landscapes to understand human geography and the consequences on our environment. The course topics include: Geography, Population, Cultural Patterns and Processes, Political Organization of Space, Agriculture and Rural Land Use, Industrialization and Economic Development, Cities and Urban Land Use.",
    "Prerequisites": "Must be enrolled in English 12 CP or higher",
    "Counseling Notes": "Students taking this course will be prepared to take the AP Exam and should have above average reading level. They may earn 3 hours of college credit by successfully completing the AP Exam. This course will satisfy the graduation requirement for World History and Geography. All students are expected to take the AP Exam."
  },
  "713433": {
    "name": "Psychology CP",
    "GPA": "4.0",
    "Credits": ["0.5"],
    "Subject": ["Social Studies"],
    "Length": ["Term"],
    "Description": "This general psychology course will introduce students to the scientific study of human and animal behavior. Units of study include human development during the life span, biological basis of behavior including the brain, the learning process, intelligence and creativity, personality theories, behavior patterns, symptoms, causes and treatments of emotional disorders, sensation and perception, and the social influences on our behavior. Average ability is required.",
    "Prerequisites": "None",
    "Counseling Notes": "This course is usually taken in conjunction with Sociology.  Students who register for this course must select another term course to partner with this one."
  },
  "713432": {
    "name": "Sociology CP",
    "GPA": "4.0",
    "Credits": ["0.5"],
    "Subject": ["Social Studies"],
    "Length": ["Term"],
    "Description": "The major goal of this course is to teach students to think like a sociologist by approaching sociology as a science. The student will learn concepts, principles, theories and methods used by sociologists in the examination of social life. The tools of sociological inquiry are then applied to the study of contemporary social issues such as cultural diversity, conformity and adaptation, social institutions and their roles in society, personality development, problems of adolescence, deviance and social control, poverty in America, race relations, sex roles, social change and collective behavior. Students will learn to develop a sociological imagination which will enable them to perceive how people's lives are shaped by their social environment and how the social environment is in turn shaped by people. It is hoped that students will learn to understand and appreciate social diversity and become more open to new ideas and philosophies.",
    "Prerequisites": "None",
    "Counseling Notes": "This course is usually taken in conjunction with Psychology CP.  Students who register for this course must select another term course to partner with this one."
  },
  "723447": {
    "name": "AP Psychology",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Social Studies"],
    "Length": ["Semester"],
    "Description": "The Advanced Placement course in Psychology is designed to allow students the opportunity to earn college credit while still in high school. The course will introduce the student to the systematic and scientific study of behavior and the mental processes of human beings and other animals. The students will be exposed to the psychological facts, principles, and phenomena associated with each of the major subfields within Psychology. Topics to be studied include the history of psychology, biological bases of behavior, sensation and perception, states of consciousness, learning, motivation and emotion, developmental psychology, personality, testing and individual differences, abnormal psychology and treatment of psychological disorders. The students will also learn about the methods and approaches psychologists use in their science and practice. This course is open to students who are able to work independently and have above-average reading skills. Depending on the score earned on the AP examination a student can earn college credits; therefore, he or she should be prepared to work on a college level. Please see the Advanced Placement entry at the beginning of the Social Studies section of the Proposed Program of Studies.",
    "Prerequisites": "None",
    "Counseling Notes": "All students are expected to take the AP Exam."
  },
  "703449": {
    "name": "Youth Leadership Development and Community Involvement Program (YLDCIP)",
    "GPA": "4.5",
    "Credits": ["0.5"],
    "Subject": ["Social Studies"],
    "Length": ["Term"],
    "Description": "Youth Leadership Development and Community Involvement Program (YLDCIP) is a community-based learning and service program that utilizes the community as the classroom. The purpose of YLDCIP is to develop student civic awareness, responsibility, and leadership through involvement in projects that are beneficial to the community. Students will work with a mentor at an off-campus organization that serves the community (other schools, non-profit organizations, religious organizations, government agencies, etc.) on-site each day during the YLDCIP period. Students will choose an area of interest and, under the guidance of their community mentor and the teacher, design an action-research project.",
    "Prerequisites": "Students must be in good academic, attendance, and discipline standing.",
    "Counseling Notes": "Students must be able to provide their own transportation to and from their YLDCIP off- campus placement. Students may take this course multiple times in the same year or in separate years.  Students must select another term course to accompany this one if they plan to take this course only one time in a given year."
  },
  "210996": {
    "name": "Band, Regular",
    "GPA": "4.0",
    "Credits": ["2.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Year-long on a block"],
    "Description": "Band, Regular - 210996: Full year - 1 credit; 9th, 10th, 11th, 12thBand is a year-long music performance class. Band members are expected to participate in marching band during the fall semester. Participation in Competitive Marching Band (CMB) is based on one’s knowledge and skills in the Fall CMB music and sets. Summer Band camp is highly recommended because it focuses solely on the Fall CMB music and sets. Students without adequate knowledge and skills in the Fall CMB music and sets are welcome and may participate as an alternate in the CMB. Students enrolled in band are expected to attend all performances and rehearsals. Students are expected to attend all after school rehearsals, generally two per week during marching season, but additional rehearsals may be called. Students are expected to perform at all football games, including playoff games, and three weekend marching contests. Students participating in marching band receive a ½ credit in Wellness C. After football season, this band performs at concerts and attends concert festivals. Regional (All East) and state clinics are an option for Regular Band students. Advanced credit is not available through the Regular Band.",
    "Prerequisites": "None",
    "Counseling Notes": "Students are expected to sign up for both semesters of this course."
  },
  "230996": {
    "name": "Band, Honors",
    "GPA": "4.5",
    "Credits": ["2.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Year-long on a block"],
    "Description": "Band, Honors is a music performance class that includes all the requirements of Regular Band. In addition, students must audition for a concert clinic such as All State East or participate in another director approved nonaudition concert clinic. Honors Band students are expected to maintain the highest standards of musicianship and citizenship.",
    "Prerequisites": "Students will audition for placement in course.",
    "Counseling Notes": "Students are expected to sign up for both semesters of this course."
  },
  "200996": {
    "name": "Color Guard",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Semester"],
    "Description": "This class is for students who have been selected as a member of the Guard. This class is open by audition only. Participation in Competitive Marching Band Guard (CMB) is based on one’s knowledge and skills in the Fall CMB music and sets. Summer Band camp is highly recommended because it focuses solely on the Fall CMB music and sets. Students without adequate knowledge and skills in the Fall CMB music and sets are welcome and may participate as an alternate in the CMB. Guard members are expected to attend all after school rehearsals, generally two per week during marching season, but additional rehearsals may be called. Guard members also perform with the marching band at all functions including football games, playoff games and marching contests. Students who participate in color guard receive a ½ credit in Wellness   C.",
    "Prerequisites": "None",
    "Counseling Notes": "None"
  },
  "260995": {
    "name": "Choir",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Semester"],
    "Description": "This class is open to all singers. The curriculum emphasizes beginning music skills including; sight reading, basic music theory, music history and vocal performance skills using a wide variety of musical styles. Some after school rehearsals and performances are required. Position available for student accompanist.",
    "Prerequisites": "None",
    "Counseling Notes": "None"
  },
  "200995": {
    "name": "Select Choir",
    "GPA": "4.25",
    "Credits": ["2.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Year-long on a block"],
    "Description": "This class is open to intermediate - advanced voiced singers by audition only. The curriculum emphasizes sight reading, music theory, music history and vocal performance skills using a wide variety of musical styles. Several after school rehearsals and performances are required. Position available for student accompanist.",
    "Prerequisites": "Students will audition for placement in course.",
    "Counseling Notes": "Students are expected to sign up for both semesters of this course."
  },
  "240995": {
    "name": "Ensemble Choir, Honors",
    "GPA": "4.5",
    "Credits": ["2.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Year-long on a block"],
    "Description": "This is an intense, fast moving class that performs advanced high school and college level music. The curriculum emphasizes sight reading, music theory, music history and vocal performance skills using a wide variety of musical styles but focusing heavily on Renaissance and Chamber music. Many after school rehearsal performances are required especially during the month of December. Students receive honors credit for this class. Limited to 16-20 singers. Position available for student accompanist.",
    "Prerequisites": "This class is open to advanced singers by audition only",
    "Counseling Notes": "Students are expected to sign up for both semesters of this course."
  },
  "223535": {
    "name": "AP Theory and Harmony",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Semester"],
    "Description": "AP music theory is a college preparatory class designed for the student who plans to continue their musical education in college. This is an intense, fast moving class that includes fundamentals of music, part writing, composition, and aural skills. Teacher approval and signature is required for this class.",
    "Prerequisites": "Students must have at least one previous year of formal study in instrumental or vocal music and be able to read standard music notation.",
    "Counseling Notes": "None"
  },
  "273530": {
    "name": "String Orchestra-9",
    "GPA": "4.0",
    "Credits": ["2.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Year-long on a block"],
    "Description": "String Orchestra is a performance group at Oak Ridge High School giving several performances throughout the year. The orchestra participates in festivals and competitions as a group as well as students playing individually in All-State and festival orchestras. Prior playing experience is required.",
    "Prerequisites": "None",
    "Counseling Notes": "Students are expected to sign up for both semesters of this course."
  },
  "263530": {
    "name": "String Orchestra, 9 Honors",
    "GPA": "4.5",
    "Credits": ["2.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Year-long on a block"],
    "Description": "Orchestra Honors is a music performance class that includes all the requirements of regular orchestra. In addition, students must audition for a concert clinic such as All State East or participate in another director approved non-audition concert clinic. Honors orchestra students are expected to maintain the highest standards of musicianship and citizenship.",
    "Prerequisites": "String Orchestra. Students must be recommended for this course.",
    "Counseling Notes": "Students are expected to sign up for both semesters of this course."
  },
  "283530": {
    "name": "String Orchestra",
    "GPA": "4.0",
    "Credits": ["2.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Year-long on a block"],
    "Description": "String Orchestra is a performance group at Oak Ridge High School giving several performances throughout the year. The orchestra participates in festivals and competitions as a group as well as students playing individually in All-State and festival orchestras. Prior playing experience is required.",
    "Prerequisites": "None",
    "Counseling Notes": "Students are expected to sign up for both semesters of this course."
  },
  "293530": {
    "name": "String Orchestra, Honors",
    "GPA": "4.5",
    "Credits": ["2.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Year"],
    "Description": "Orchestra Honors is a music performance class that includes all the requirements of regular orchestra. In addition, students must audition for a concert clinic such as All State East or participate in another director approved non-audition concert clinic. Honors orchestra students are expected to maintain the highest standards of musicianship and citizenship.",
    "Prerequisites": "String Orchestra",
    "Counseling Notes": "Students are expected to sign up for both semesters of this course."
  },
  "123501": {
    "name": "Art Foundations",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Semester"],
    "Description": "Foundations of Art is an introductory and survey course. Foundations of Art provides a variety of experiences that build on concepts and techniques. It is designed to answer the question “What is Art?” Answers to this question are discovered through the exploration of two-dimensional and three- dimension formats. Art history, design and composition, and aesthetic criticism are integrated into the curriculum. Th purpose of this course is to foster critical thinking skills, strengthen art skills, broaden students’ knowledge and appreciation of art, and bring awareness as it appears in the world around them.  This course will  prepare students for additional art courses. Independent work in a studio setting is a frequent expectatio",
    "Prerequisites": "None",
    "Counseling Notes": "$25 Art Fee requested."
  },
  "133501": {
    "name": "Art 9th Grade Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Semester"],
    "Description": "Art 9th Grade Honors - Students will explore and learn media of both 2-D, 3-D and Computer art. Students will present their work to the instructor and identify artists that share their style, process, and/or inspiration. Students will also learn the origins and history of art and research careers related to art in which their talents are recognized. The class is recommended for students who have exhibited a strong interest in art at the middle school level and have been recognized by their middle school art teacher for their talent in this area. Four hours of art related community service are necessary to fulfill the honors requirement. After the completion of the course, students will be encouraged and prepared to  advance their skills into other advanced art courses offered through the art department.",
    "Prerequisites": "Submission of a portfolio, interview with a high school art teacher, and recommendation from both their 8th grade art teacher and high school art teacher are required.",
    "Counseling Notes": "$25 Fee requested."
  },
  "153503": {
    "name": "Ceramics",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Semester"],
    "Description": "Ceramics is a studio art course in which students will create hand built and wheel thrown clay pieces. Students must have a strong interest in working with clay materials. Students will learn basic hand- building, wheel throwing, firing, and alternative clay techniques. Students will create and design sculptural, functional, and well-crafted works of art as they relate to ceramics. There is a significant amount of studio maintenance required in this class and a grade is calculated for this activity. Attendance is an important factor in this class and will be considered when students apply for the course. Tools and materials are not available for home use and in the event of absences the student must arrange to make up class time during lunch, guided study or after school.",
    "Prerequisites": "Teacher Recommendation Required and Foundations of Art",
    "Counseling Notes": "Art Fee $75 requested."
  },
  "163503": {
    "name": "DE Ceramics",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Semester"],
    "Description": "Dual Enrollment Ceramics is a studio art course which allows students to receive an art credit with an additional option to receive college credit. Students must have a strong interest in working with clay materials. Students will learn basic hand-building, wheel throwing, firing, and alternative clay techniques. Students will create and design sculptural, functional, and well-crafted works of art as they relate to ceramics. There is a significant amount of studio maintenance required in this class, and a grade is calculated for this activity. Attendance is an important factor in this class and will be considered when students apply for the course. Tools and materials are not available for home use. Upon completion of the college semester, students are required to submit a portfolio of their work for the college credit.",
    "Prerequisites": "Teacher Recommendation and one year of ceramics",
    "Counseling Notes": "Art Fee:  $75 requested.  See Dual Enrollment section for more information."
  },
  "153532": {
    "name": "AP Art Studio",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Semester"],
    "Description": "The AP Studio Art Course is designed for students who wish to assemble a body of artwork that demonstrates a high level of thought, growth, and quality. The course prepares students for three different AP Exams. Students choose from a 2-D design portfolio, drawing portfolio, or 3-D Design portfolio. Students work to develop a mastery of concept, composition, and execution of their personal ideas and themes in one of the chosen portfolio areas. The course emphasizes art making as an ongoing process involving critical thinking and personal expression, as well as a variety of concepts and approaches in design problem solving.  The course examines two aspects of portfolio development—Sustained Investigation and Selected Works. Throughout the year, the students complete work towards these two sections. Selected Works will be teacher driven, although previous quality work may be considered for this section. The theme for the development of a personal concentrated body of work will be identified through discussion and critique between the student and teacher. The Sustained Investigation will focus on a group of related works. These works must demonstrate a serious purpose and show growth over time. Group critiques are necessary for assessment throughout the art production. An ongoing dialog with the teacher and documentation of artwork will be mandatory.",
    "Prerequisites": "https://ortn.instructure.com/courses/5149",
    "Counseling Notes": "Art Foundations and teacher recommendation."
  },
  "173504": {
    "name": "Photography",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Semester"],
    "Description": "This course is designed for the student who is interested in art as it relates to photography. The student will study an overview of the history of photography and understand the mechanics of both 35 MM film and digital cameras. Students will study composition and design and apply this knowledge to the taking of photographs. Students learn the basic techniques of developing and printing of black and white film and photos in the darkroom, as well as best practices for printing digital images on inkjet printers. As students develop basic skills of working a camera and in a darkroom, we will begin creative manipulation of photographs.",
    "Prerequisites": "https://ortn.instructure.com/courses/3321/assignments/syllabus",
    "Counseling Notes": "Art Foundations and art teacher recommendation"
  },
  "173505": {
    "name": "DE Photography",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Semester"],
    "Description": "Dual Credit Ceramics is a studio art course which allows students to receive an art credit with an additional option to receive college credit. Students must have a strong interest is working with photography. The student will study an overview of the history of photography and understand the mechanics of both 35 MM film and digital cameras. Students will study composition and design and apply this knowledge to the taking of photographs. Students learn the basic techniques of developing and printing of black and white film and photos in the darkroom, as well as best practices for printing digital images on inkjet printers. As students develop basic skills of working a camera and in a darkroom, we will begin creative manipulation of photographs. Upon completion of the college semester students are required to submit a portfolio of their work for the college credit.",
    "Prerequisites": "https://ortn.instructure.com/courses/3321/assignments/syllabus",
    "Counseling Notes": "Art Foundations and art teacher recommendation"
  },
  "153504": {
    "name": "Art 2-D, Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["Fine Arts"],
    "Length": ["Semester"],
    "Description": "This class is designed to concentrate on a variety of art making processes including mixed and printed media. Students will be encouraged to experiment with tools, techniques and materials. Through practice and discipline students will develop skills and an ability to communicate ideas and feelings through art and composition about life and the world. 2-D Advanced Art will include community volunteer work. Group critiques are necessary for assessment throughout the art production. An ongoing dialog with the teacher and  documentation of artwork will be mandatory.",
    "Prerequisites": "https://ortn.instructure.com/courses/3318",
    "Counseling Notes": "Art Foundations and art teacher recommendation"
  },
  "523041": {
    "name": "French 1 CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "French I is an entry-level course designed for students who are new to the study of French or for students with limited proficiency in prior language study. The main focus of the course is on the development of communication proficiency in the target language. Grammatical concepts and vocabulary will be taught in context from within six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. These cultural themes will be explored through authentic sources, such as news articles, video clips, music, literature, etc. and may be supplemented by the textbook. There is an emphasis in the use of technology as it provides a venue for students to enhance their speaking and listening comprehension.",
    "Prerequisites": "None",
    "Counseling Notes": "None"
  },
  "503042": {
    "name": "French 2 CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "In this course, students will continue to develop an understanding and appreciation of other cultures as they learn the target language. Grammatical concepts and vocabulary will be taught in context from within six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. These cultural themes will be explored through authentic sources, such as news articles, video clips, music, literature, etc. and may be supplemented by the textbook. There is a great emphasis in the use of technology as it provides a venue for students to enhance their speaking and listening comprehension.",
    "Prerequisites": "French 1",
    "Counseling Notes": "None"
  },
  "523042": {
    "name": "French 2 Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "This course is designed for students who plan to pursue advanced levels of language studies. Students who have outstanding achievement in Level 1 are encouraged to enroll in this course. This class includes all the elements found in Level 2 CP while emphasizing critical thinking and independent research. Grammatical concepts and vocabulary will be taught in context from within six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. These cultural themes will be explored through authentic sources, such as news articles, video clips, music, literature, etc. and may be supplemented by the textbook. There is a great emphasis in the use of technology as it provides a venue for students to enhance their speaking and listening comprehension.",
    "Prerequisites": "French 1",
    "Counseling Notes": "None"
  },
  "513043": {
    "name": "French 3 Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "This course is designed for students who plan to pursue advanced levels of language studies. Students who have outstanding achievement in level 2 or level 2 Honors are encouraged to enroll in this course. Students will continue to develop an understanding and appreciation of other cultures as they learn the target language, while emphasizing critical thinking skills and independent research. Grammatical concepts and vocabulary will be taught in context from within six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. These cultural themes will be explored through authentic sources, such as news articles, video clips, music, art, literature, etc. and may be supplemented by the textbook. There is a great emphasis in the use of technology as it provides a venue for students to enhance their speaking and listening comprehension.",
    "Prerequisites": "French 2 or French 2 Honors",
    "Counseling Notes": "None"
  },
  "513046": {
    "name": "French 4 Honors",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "This course is designed to encourage students to interact in a global community. Communication is the emphasis along with vocabulary expansion within the six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. Students will improve fluency and grammatical accuracy by using the three modes of communication: Interpersonal (speaking, listening, and writing), Presentational (speaking and writing), and Interpretative (reading and listening). Materials include authentic sources such as cultural and historical readings, short stories, poetry, music, art, websites, and films in order to maximize communication in real-life situations and gain cultural understanding. Classes are conducted entirely in French and students are expected to speak only in the target language. In addition, students are highly encouraged to seek out opportunities to use the target language outside the classroom.",
    "Prerequisites": "French 3 Honors",
    "Counseling Notes": "None"
  },
  "513044 513047": {
    "name": "DE French 5/ French 5 Honors",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "Dual Enrollment provides the option of earning Beginning French 1 and 2 credit through Roane State Community College. This course is designed to encourage students to interact in a global community. Communication is the emphasis along with vocabulary expansion within the six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. Students will improve fluency and grammatical accuracy by using the three modes of communication: Interpersonal (speaking, listening, and writing), Presentational (speaking and writing), and Interpretative (reading and listening). Materials include authentic sources such as cultural and historical readings, short stories, poetry, music, art, websites, and films in order to maximize communication in real-life situations and gain cultural understanding. Classes are conducted entirely in French and students are expected to speak only in the target language. In addition, students are highly encouraged to seek out opportunities to use the target language outside the classroom.",
    "Prerequisites": "French 3 Honors; 3.0 GPA; 19 in Reading and an 18 in English on the ACT.",
    "Counseling Notes": "Students must be dually enrolled at RSCC in order to benefit from the DE grading scale.  If not dually enrolled, a student’s grade will be reported using the Honors grading scale."
  },
  "523045": {
    "name": "AP French Language",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "This course is designed to prepare students to interact in a global community. Communication is the emphasis along with vocabulary expansion within the six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. Students will refine fluency and grammatical accuracy by using the three modes of communication: Interpersonal (speaking, listening, and writing), Presentational (speaking and writing), and Interpretative (reading and listening). Materials include authentic sources such as radio talk shows, news articles, emails, and music from French-speaking countries in order to maximize communication in real-life situations and gain cultural understanding. Classes are conducted entirely in French and students are expected to speak only French in class. In addition, students are also encouraged to seek opportunities to use the target language outside of the classroom. In preparation for the AP Exam in French Language and Culture, students will be taught specific test-taking strategies and will practice for the exam.",
    "Prerequisites": "DE French 4",
    "Counseling Notes": "If the student does not participate in the culminating exam by the end of the school year in which the course was completed (Advanced Placement exam), the grading scale would revert to the honors scale."
  },
  "503051": {
    "name": "German 1 CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "German I is an entry-level course designed for students with no previous German courses in the target language. The main focus of the course is on the development of communication proficiency in German. Grammatical concepts and vocabulary will be taught in context from within six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. These cultural themes will be explored through authentic sources, such as news articles, video clips, music, literature, etc. and will be supplemented by a textbook. German 1 CP uses technology as it provides a venue for students to enhance their speaking and listening comprehension.",
    "Prerequisites": "None",
    "Counseling Notes": "None"
  },
  "513052": {
    "name": "German 2 CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "In this course, students will continue to develop an understanding and appreciation of other cultures as they learn the target language. Grammatical concepts and vocabulary will be taught in context from within six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. These cultural themes will be explored through authentic sources, such as news articles, video clips, music, literature, etc. and may be supplemented by a textbook. German 2 CP uses technology as it provides a venue for students to enhance their speaking and listening comprehension.",
    "Prerequisites": "German 1",
    "Counseling Notes": "None"
  },
  "523052": {
    "name": "German 2 Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "This course is designed for students who plan to pursue advanced levels of German studies. Students who have outstanding achievement in German 1 are encouraged to enroll in this course. This class includes all the elements found in CP German 2 while emphasizing critical thinking and independent research. Students will conduct theme specific projects. Grammatical concepts and vocabulary will be taught in context from within six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. These cultural themes will be explored through authentic sources, such as news articles, video clips, music, literature, etc. and may be supplemented by a textbook. German 2 Honors uses technology as it provides a venue for students to enhance their speaking and listening comprehension.",
    "Prerequisites": "German 1 and recommendation by teacher",
    "Counseling Notes": "None"
  },
  "513053": {
    "name": "German 3 Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "This course is designed for students who plan to pursue advanced levels of language studies. Students who have outstanding achievement in level 2 or level 2 Honors are encouraged to enroll in this course. Students will continue to develop an understanding and appreciation of other cultures as they learn the target language, while emphasizing critical thinking skills and independent research. Grammatical concepts and vocabulary will be taught in context from within six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. These cultural themes will be explored through authentic sources, such as news articles, video clips, music, literature, etc. and may be supplemented by a textbook. German 3 Honors uses technology as it provides a venue for students to enhance their speaking and listening comprehension.",
    "Prerequisites": "German 2 and recommendation by teacher or German 2 Honors",
    "Counseling Notes": "None"
  },
  "523054": {
    "name": "German 4 Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "This course is designed to encourage students to interact in a global community. Communication is the emphasis along with vocabulary expansion within three of the 6 cultural themes: Science and Technology, Contemporary Life, and Personal and Public Identity, Family and Communities, Global Challenges, and Beauty and Aesthetics. Students will improve fluency and grammatical accuracy by using the three modes of communication: Interpersonal (speaking, listening, and writing), Presentational (speaking and writing), and Interpretative (reading and listening). Materials include authentic sources such as cultural and historical readings, short stories, poetry, music, art, websites, and films in order to maximize communication in real-life situations and gain cultural understanding. Classes are conducted entirely in German and students are expected to speak only in the target language. Students will be introduced and practice skills to accomplish tasks specific for the AP level.  In addition, students are highly encouraged to seek out opportunities to use the target language outside the classroom.",
    "Prerequisites": "German 3 Honors or recommendation by teacher",
    "Counseling Notes": "None"
  },
  "523055": {
    "name": "AP German Language",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "This course is designed to encourage students to interact in a global community. Communication is the emphasis along with vocabulary expansion within the six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. Students will improve fluency and grammatical accuracy by using the three modes of communication: Interpersonal (speaking, listening, and writing), Presentational (speaking and writing), and Interpretative (reading and listening). Materials include authentic sources such as cultural and historical readings, short stories, poetry, music, art, websites, and films in order to maximize communication in real-life situations and gain cultural understanding. Classes are conducted entirely in German and students are expected to speak only German in class. In addition, students are also encouraged to seek opportunities to use the target language outside of the classroom. In preparation for the AP Exam in German Language and Culture, students will be taught specific test-taking strategies and will practice for the exam.",
    "Prerequisites": "German 4 Honors German",
    "Counseling Notes": "If the student does not participate in the culminating exam by the end of the school year in which the course was completed (Advanced Placement exam), the grading scale would revert to the honors scale."
  },
  "503021": {
    "name": "Spanish 1 CP S2",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "Spanish I is an entry-level course designed for students with no previous language study or for students with limited proficiency in prior elementary, middle school, or Spanish 1 courses. The main focus of the course is on the development of communication proficiency in the target language. Grammatical concepts and vocabulary will be taught in context from within six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. These cultural themes will be explored through authentic sources, such as news articles, video clips, music, literature, etc. and may be supplemented by a textbook. There is an emphasis in the use of technology as it provides a venue for students to enhance their speaking and listening comprehension.",
    "Prerequisites": "none",
    "Counseling Notes": "*Students repeating Span 1 should be enrolled in 503020 in the fall semester."
  },
  "503020": {
    "name": "Spanish 1 CP S1",
    "Credits": ["1.0"],
    "Subject": ["World Languages"]
  },
  "503022": {
    "name": "Spanish 2 CP S1",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "In this course, students will continue to develop an understanding and appreciation of other cultures as they learn the target language. Grammatical concepts and vocabulary will be taught in context from within six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. These cultural themes will be explored through authentic sources, such as news articles, video clips, music, literature, etc. and may be supplemented by the textbook. There is a great emphasis in the use of technology as it provides a venue for students to enhance their speaking and listening comprehension.",
    "Prerequisites": "Spanish 1",
    "Counseling Notes": "*Students repeating Span 2 should be enrolled in 503023 in the spring semester."
  },
  "503023": {
    "name": "Spanish 2 CP S2",
    "Credits": ["1.0"],
    "Subject": ["World Languages"]
  },
  "523022": {
    "name": "Spanish 2 Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "This course is designed for students who plan to pursue advanced levels of language studies. Students who have outstanding achievement in Level 1 are encouraged to enroll in this course. This class includes all the elements found in Level 2 CP while emphasizing critical thinking and independent research. Grammatical concepts and vocabulary will be taught in context from within six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. These cultural themes will be explored through authentic sources, such as news articles, video clips, music, literature, etc. and may be supplemented by the textbook. There is a great emphasis in the use of technology as it provides a venue for students to enhance their speaking and listening comprehension.",
    "Prerequisites": "Spanish 1",
    "Counseling Notes": "None"
  },
  "523023": {
    "name": "Spanish 3 Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "This course is designed for students who plan to pursue advanced levels of language studies. Students who have outstanding achievement in level 2 or level 2 Honors are encouraged to enroll in this course. Students will continue to develop an understanding and appreciation of other cultures as they learn the target language, while emphasizing critical thinking skills and independent research. Grammatical concepts and vocabulary will be taught in context from within six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. These cultural themes will be explored through authentic sources, such as news articles, video clips, music, literature, etc. and may be supplemented by the textbook. There is a great emphasis in the use of technology as it provides a venue for students to enhance their speaking and listening comprehension.",
    "Prerequisites": "Spanish 2 or Spanish 2 Honors",
    "Counseling Notes": "None"
  },
  "513024": {
    "name": "Spanish 4 Honors",
    "Credits": ["1.0"],
    "Subject": ["World Languages"]
  },
  "513025": {
    "name": "DE Spanish 4",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "Dual Enrollment provides the option of earning Beginning Spanish 1 and 2 credit through Roane State Community College. This course is designed to encourage students to interact in a global community. Communication is the emphasis along with vocabulary expansion within the six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. Students will improve fluency and grammatical accuracy by using the three modes of communication: Interpersonal (speaking and writing), Presentational (speaking and writing), and Interpretative (reading and listening). Materials include authentic sources such as cultural and historical readings, short stories, poetry, music, art, websites, and films in order to maximize communication in real-life situations and gain cultural understanding. Classes are conducted entirely in Spanish and students are expected to speak only Spanish in class. In addition, students are also encouraged to seek opportunities to use the target language outside of the classroom.",
    "Prerequisites": "Spanish 3 Honors; 3.0 GPA with a 19 in Reading on the ACT.",
    "Counseling Notes": "If the student is not dually enrolled at RSCC, the grading scale would revert to the honors scale."
  },
  "523025": {
    "name": "AP Spanish Language and Culture",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "This course is designed to prepare students to interact in a global community. Communication is the emphasis along with vocabulary expansion within the six cultural themes: Family and Communities, Science and Technology, World Challenges, Beauty and Aesthetics, Personal and Public Identities, and Contemporary Life. Students will refine fluency and grammatical accuracy by using the three modes of communication: Interpersonal (speaking, listening, and writing), Presentational (speaking and writing), and Interpretative (reading and listening). Materials include authentic sources such as radio talk shows, news articles, emails, and music from Spanish-speaking countries to maximize communication in real-life situations and gain cultural understanding. Classes are conducted entirely in Spanish and students are expected to speak only Spanish in class. In addition, students are also encouraged to seek opportunities to use the target language outside of the classroom. In preparation for the AP Exam in Spanish Language and Culture, students will be taught specific test-taking strategies and will practice for the exam.",
    "Prerequisites": "DE Spanish 4/Spanish 4 Honors",
    "Counseling Notes": " If the student does not participate in the culminating exam by the end of the school year in which the course was completed (Advanced Placement exam) then the grading scale would revert to the honors scale."
  },
  "523026": {
    "name": "AP Spanish Literature and Culture",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["World Languages"],
    "Length": ["Semester"],
    "Description": "This course is designed to provide students with a learning experience equivalent to that of a college/university survey course in literature written in Spanish. The course provides opportunities for students to demonstrate their proficiency across the three modes of communication: Interpersonal (speaking and writing), Presentational (speaking and writing), and Interpretative (reading and listening). Students are introduced to the formal study of a representative body of texts from Peninsular Spanish, Latin American and U.S. Hispanic literature, including short stories, novels, poetry, drama, and essays. The goal is for students to read critically, think deeply, and write analytically to demonstrate their understanding of the representative texts and to apply what they have learned from the required texts to others. The course will be enhanced by the inclusion of works of art, music, and film to encourage exploration from multiple points of view. In preparation for the AP Exam in Spanish Literature and Culture, students will be taught specific test-taking strategies and will practice for the exam.",
    "Prerequisites": "AP Spanish Language and Culture",
    "Counseling Notes": " If the student does not participate in the culminating exam by the end of the school year in which the course was completed (Advanced Placement exam) then the grading scale would revert to the honors scale."
  },
  "903303": {
    "name": "Lifetime Wellness A",
    "GPA": "4.0",
    "Credits": ["0.5"],
    "Subject": ["Wellness"],
    "Length": ["Term"],
    "Description": "Wellness A focuses on emotional and mental health, nutrition, drug misuse and abuse, integrated sex education and preventative diseases. Wellness A is a one semester course which meets during regular class periods.",
    "Prerequisites": "None",
    "Counseling Notes": "NJROTC may not be used in lieu of Wellness A. This course is usually taken in conjunction with Wellness B.  Students who register for this course must select another term course to partner with this one."
  },
  "923303": {
    "name": "Lifetime Wellness B",
    "GPA": "4.0",
    "Credits": ["0.5"],
    "Subject": ["Wellness"],
    "Length": ["Term"],
    "Description": "Wellness B focuses on the physical conditioning of the body as it relates to the whole person. Activity through team sports and individual/dual sports makes up the majority of this class.",
    "Prerequisites": "None",
    "Counseling Notes": "This course is usually taken in conjunction with Wellness A.  Students who register for this course must select another term course to partner with this one. Wellness B may be taken any time before graduation. Students may earn their Wellness B credit through NJROTC.  Students may take this course twice in order to meet the requirements for the additional one half credit of activity required for graduation."
  },
  "983303": {
    "name": "Lifetime Wellness C - Cardio",
    "GPA": "4.0",
    "Credits": ["0.5"],
    "Subject": ["Wellness"],
    "Length": ["Term or Year-long skinny at lunch*"],
    "Description": "Wellness C – Cardio is primarily a walking class. A minimal amount of classroom instruction may be included.",
    "Prerequisites": "None",
    "Counseling Notes": "The class will be offered during half of the lunch period. Students will participate for one half period for the entire school year to earn their .5 credit for Wellness C."
  },
  "913301": {
    "name": "Physical Education I",
    "GPA": "4.0",
    "Credits": ["0.5"],
    "Subject": ["Wellness"],
    "Length": ["Term"],
    "Description": "This course fulfills the .5 credit requirement for Wellness C.",
    "Prerequisites": "None",
    "Counseling Notes": "This course may be taken for two terms. Athletic Conditioning can count for the additional one half credit of activity required for graduation but cannot be taken in lieu of Wellness B."
  },
  "913302": {
    "name": "Athletic Conditioning",
    "GPA": "4.0",
    "Credits": ["0.5"],
    "Subject": ["Wellness"],
    "Length": ["Term"],
    "Description": "The main emphasis of this class will be on strength development through resistance training. Students will work out in a structured and controlled atmosphere designed to improve their physical condition for athletics. Aerobic activities will be supplemented in order to tax the cardio-vascular system.",
    "Prerequisites": "Wellness B",
    "Counseling Notes": "This course may be taken for two terms. Athletic Conditioning can count for the additional one half credit of activity required for graduation but cannot be taken in lieu of Wellness B."
  },
  "803001": {
    "name": "English 9 Workshop",
    "GPA": "4.0",
    "Credits": ["2.0"],
    "Subject": ["English"],
    "Length": ["Year-long on a block"],
    "Description": "This course is designed for students who have been formally assessed as having serious difficulties in reading and writing. Placement is determined through the RTI committee for Tier III Intervention. Assessments used to determine a student’s area of need include the Gates-MacGinitie Reading Test, EXPLORE, STAR, writing samples, and TNReady scores. The student’s academic difficulties and deficiencies will be assessed and analyzed in order to have a holistic view of the student. Developmental reading skills are taught through various fiction and nonfiction literary selections chosen by the student and/or teacher. Students develop critical thinking and discussion skills through the study of a multicultural selection of short stories, nonfiction, novels, poetry, and drama. Students practice recognizing ideas, arranging events in sequence, and supporting opinions with examples. The writing responses emphasize organizing for clarity. Writing assignments are designed to improve reading and writing skills and often stress summaries and explanations of the reading. Daily attendance, completion of assigned work, reading practice, and mastery of state standards will make for success in the course.",
    "Prerequisites": "None",
    "Counseling Notes": "This course is one year in length and on a block.  Students must complete both semesters in order to meet graduation requirements for English I."
  },
  "813001": {
    "name": "English 9 CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["English"],
    "Length": ["Semester"],
    "Description": "This course begins a four-year progression of literary analysis in various literary genres. Students develop critical thinking and discussion skills through the study of a multicultural selection of short stories, nonfiction, novels, poetry, and drama. Students will conduct research, plan and write in expository, argumentative, and narrative modes, and review the fundamental principles of grammar and language.",
    "Prerequisites": "None",
    "Counseling Notes": "None"
  },
  "823001 843001": {
    "name": "English 9 Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["English"],
    "Length": ["Semester or Year-long skinny*"],
    "Description": "This course begins a four-year progression of literary analysis in various literary genres for students with above average reading and writing abilities and/or teacher recommendations. Students taking this course practice rigorous thinking and writing skills necessary for their future success at the Honors/Advanced/AP level and are expected to read and write extensively, often outside of class. Students will also complete an extensive literary research project, plan and write in expository, argumentative, and narrative modes, and review the principles of grammar and language.",
    "Prerequisites": "None",
    "Counseling Notes": "None; This course is taught for one semester on a block schedule. *(English 9 Honors A:  843001) is a co-requisite of AVID 9 and meets all year for ½ of the block period."
  },
  "853001": {
    "name": "English 9 Honors: Combined Studies",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["English"],
    "Length": ["Year-long skinny on a block*"],
    "Description": "Combined Studies is a team-taught AP/Honors course in Unites States Government and Politics and literature. This course is designed for students with above-average reading and writing abilities and/or teacher recommendations. Students taking this course practice thinking and writing skills necessary for success in English class and on the paired course Advanced Placement U.S. Government and Politics Exam. Students complete an extensive literary research project and are expected to complete most reading and writing assignments out of class.",
    "Prerequisites": "English 9",
    "Counseling Notes": "*This course is taken in conjunction with AP US Government and Politics.  It will meet all year for ½ of a block period."
  },
  "833001": {
    "name": "English 10 Workshop",
    "GPA": "4.0",
    "Credits": ["2.0"],
    "Subject": ["English"],
    "Length": ["Year-long on a block"],
    "Description": "This course is designed for students who have been formally assessed as having serious difficulties in reading and writing. Placement is determined through the RTI committee for Tier III Intervention. Assessments used to determine a student’s area of need include the Gates-MacGinitie Reading Test, Aimsweb, STAR, writing samples, and TNReady scores. The student’s academic difficulties and deficiencies will be assessed and analyzed in order to have a holistic view of the student.  Developmental reading skills are taught through various fiction and nonfiction literary selections chosen by the student and/or teacher. Students develop critical thinking and discussion skills through the study of a multicultural selection of short stories, nonfiction, novels, poetry, and drama. Students practice recognizing ideas, arranging events in sequence, and supporting opinions with examples. The writing responses emphasize organizing for clarity. Writing assignments are designed to improve reading and writing skills and often stress summaries and explanations of the reading. Daily attendance, completion of assigned work, reading practice, and mastery of state standards will make for success in the course. Literature selections include significant pieces of American Literature.",
    "Prerequisites": "English 9",
    "Counseling Notes": "This course is one year in length and on a block.  Students must complete both semesters in order to meet graduation requirements for English II."
  },
  "813002": {
    "name": "English 10 CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["English"],
    "Length": ["Semester"],
    "Description": "This course continues a four-year progression of literary analysis in various literary genres. Students develop critical thinking and discussion skills through the study of a multicultural selection of short stories, nonfiction, novels, poetry, and drama. Students will conduct research, plan and write in expository, argumentative, and narrative modes, and review the fundamental principles of grammar and language.",
    "Prerequisites": "English 9",
    "Counseling Notes": "None"
  },
  "823002 823003": {
    "name": "English 10 Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["English"],
    "Length": ["Semester or Year-long skinny on a block*"],
    "Description": "English 10 Honors is a course in world literature designed for students with above-average reading and writing abilities and/or teacher recommendations. Because this course is preparation for Junior Advanced Placement English Literature and Composition, students taking this course practice rigorous thinking and writing skills necessary for their future success at the AP level and are expected to read and write extensively. Students complete an extensive literary research project and are expected to complete most reading and writing assignments out of class.",
    "Prerequisites": "English 9",
    "Counseling Notes": "(English 10 Honors A:  823003) is a co-requisite of AVID 10 and meets all year for ½ of the block"
  },
  "833002": {
    "name": "English 10 Honors: Combined Studies",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["English"],
    "Length": ["Year-long skinny on a block*"],
    "Description": "Combined Studies is a team-taught AP/Honors course in world history and world literature. This course is designed for students with above-average reading and writing abilities and/or teacher recommendations. Students taking this course practice thinking and writing skills necessary for success in English class and on the paired course Advanced Placement World History Exam. Students complete an extensive literary research project and are expected to complete most reading and writing assignments out of class.",
    "Prerequisites": "English 9",
    "Counseling Notes": "*This course is taken in conjunction with AP World History.  It will meet all year for ½ of a block period."
  },
  "803003": {
    "name": "English 11 CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["English"],
    "Length": ["Semester"],
    "Description": "This course continues a four-year progression of literary analysis in various literary genres. Students develop critical thinking and discussion skills through the study of American Literature. Students will conduct research; plan and write in expository, argumentative, and narrative modes; and review the principles of grammar and language.",
    "Prerequisites": "English 10",
    "Counseling Notes": "None"
  },
  "813003": {
    "name": "English 11 Honors",
    "GPA": "4.5",
    "Credits": ["1.0"],
    "Subject": ["English"],
    "Length": ["Semester"],
    "Description": "This advanced course refines literary analysis and writing skills. Students who take this course enroll in postsecondary institutions that range from highly selective schools to state universities and community colleges. Class work includes extensive reading and literary analysis of American literature from the Colonial Era through the present. Students reinforce skills with vocabulary work. Students complete an extensive literary research project and are expected to complete most reading and writing assignments out of class. Many of these students will elect to continue their academic study by taking AP English Literature and Composition.",
    "Prerequisites": "English 10",
    "Counseling Notes": "None"
  },
  "853014": {
    "name": "AP English Language and Composition",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["English"],
    "Length": ["Semester"],
    "Description": "This course is designed for students who want a demanding college level course and/or who plan to take the Advanced Placement Examination in English Language and Composition at the end of the junior year. The course focuses on the elements that define effective argument and composition through the critical analysis and interpretation of complex nonfiction texts.  Students will understand the interactions among a writer’s purpose, audience, subject, and genre and how each of these contributes to effective writing. Students will also enhance their own writing skills and understand better each stage of the writing process as they develop expository, analytical, and argumentative compositions.  Above-average writing skills and self-discipline for independent study are necessary for success in this course.",
    "Prerequisites": "English 10",
    "Counseling Notes": "Students are encouraged to take the AP English Language and Composition exam in May of their Junior year."
  },
  "853015": {
    "name": "AP English Language and Composition: Combined Studies",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["English"],
    "Length": ["Year-long skinny on a block*"],
    "Description": "Combined Studies is comprised of two AP courses:  AP United States History and AP English Language and",
    "Prerequisites": "http://www.ortn.edu/central-office/teaching-and-learning/curriculum/high-school/",
    "Counseling Notes": "English 10"
  },
  "853005": {
    "name": "English 12",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["English"],
    "Length": ["Semester"],
    "Description": "This course is designed for continued refinement of critical reading skills, literary analysis and writing skills with an emphasis on synthesizing multiple sources. Students who take this course enroll in post-secondary institutions that primarily include community colleges and technical/trade schools. Literary selections range from classic British Literature to contemporary pieces and informational text. Students will also focus on vocabulary acquisition, research and presentation skills, and ACT preparation.  A yearlong Major Theme project is required.",
    "Prerequisites": "English 11",
    "Counseling Notes": "None"
  },
  "813005": {
    "name": "English 12 CP",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["English"],
    "Length": ["Semester"],
    "Description": "This course continues a four-year progression of literary analysis in various literary genres. Students develop critical thinking and discussion skills through the study of British Literature. Students will conduct research, plan and write in expository, argumentative, and narrative modes, and review the principles of grammar and language. A research project is required.",
    "Prerequisites": "English 11",
    "Counseling Notes": "None"
  },
  "823014": {
    "name": "AP English Literature and Composition",
    "GPA": "5.0",
    "Credits": ["1.0"],
    "Subject": ["English"],
    "Length": ["Semester"],
    "Description": "This course is designed for students who want a demanding college level course and who plan to take the Advanced Placement Examination in English Literature and Composition at the end of senior year. This course focuses on British and American literature and requires students to write advanced literary analysis and read challenging works that span the Anglo-Saxon to modern eras. Students should expect to spend at least an hour outside of class each day on homework. In addition, a capstone research project focuses on a literary period and two major works of the period. Students should also be aware that issues that might form particular social, historical, or cultural viewpoints be considered controversial, including references to ethnicities, nationalities, religions, races, dialects, gender, or class, may be addressed in tests that are appropriate for the AP English Literature and Composition course. Fair representation of issues and peoples may occasionally include controversial material. Since AP students have chosen a program that directly involves them in college level work, participation in this course depends on a level of maturity consistent with the age of high school students who have engaged in thoughtful analyses of a variety of texts.",
    "Prerequisites": "English 11",
    "Counseling Notes": "Students are encouraged to take the AP English Literature exam at the end of the year."
  },
  "803012": {
    "name": "Creative Writing",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["English"],
    "Length": ["Semester"],
    "Description": "Prerequisite –Sophomore, junior, or senior students who have a ‘C” grade or higher in their college preparatory English classes. This course is open to any student who is interested in the study and practice of descriptive and narrative writing. Poetry, short stories, children’s stories, personal essays, and scripts provide models for students to discuss and imitate. Students work on finding individual voice, enhancing description, developing characters, improvising with imagery and language, experimenting with different genres and forms, and increasing selfconfidence. Journal writing and peer editing are critical elements of the course. Students are expected to develop and submit some work for publication or competition. With instructor approval, a second half credit may be earned for an additional semester's work.",
    "Prerequisites": "English 9",
    "Counseling Notes": "None"
  },
  "803013": {
    "name": "Technical Writing",
    "GPA": "4.0",
    "Credits": ["1.0"],
    "Subject": ["English"],
    "Length": ["Semester"],
    "Description": "Technical writing is often broadly defined as any writing that takes place in the workplace. To be more specific, it is any writing that is intended to convey information, especially that which is related to scientific or technical information or processes. Students who take this course will be expected to read, analyze, and evaluate a variety of technical literature, in addition to producing their own in multiple formats and on numerous topics. The writing process will be a cornerstone of the course, with added emphasis on the importance of revision and peerediting. By the end of the course, students will be required to produce multiple products of varying lengths, including emails, memos, product and process descriptions, proposals, press releases, user guides, and one long work such as a manual, prospectus, or a white paper.",
    "Prerequisites": "English 9",
    "Counseling Notes": "None"
  },
  "873008": {
    "name": "Journalism I and II- Oak Log",
    "GPA": "4.0",
    "Credits": ["2.0"],
    "Subject": ["English"],
    "Length": ["Year-long on a block*"],
    "Description": "Admission to Oak Log requires permission of the adviser, and students must be upperclassmen. Students plan and produce the school yearbook. Students must conduct interviews and write articles. They assist in page design and also compose copy, write headlines and captions, take photographs, and use laptop computers for internet publishing. Students leave campus to sell advertising to help finance the book's production. Oak Log work requires after-school time. Students must work independently and meet deadlines. Additional credits may be earned for enrollment in consecutive years.  Journalism meets the requirements for an area of focus in humanities.",
    "Prerequisites": "English 9; Application and approval of instructor",
    "Counseling Notes": "*Students are encouraged to take this course both semesters.  However, students who only register for one semester must take Journalism in the fall.  The fall semester is a prerequisite for the spring semester."
  },
  "816309 816310 816311 816312": {
    "name": "English Language Development 9, 10,11, 12",
    "GPA": "4.0",
    "Credits": ["2.0"],
    "Subject": ["English"],
    "Length": ["Year-long on a block"],
    "Description": "This course is designed for students identified as English learners. This course offers explicit instruction in listening, speaking, reading, and writing with emphasis placed on the development of academic language proficiency. Instruction is aligned with both the WIDA Standards and the Tennessee state standards. All English learners participate in WIDA English language assessments which are designed to measure an EL’s social and academic English proficiency. Daily attendance, completion of assigned work, and language practice will make for success in this course. Additionally, this course provides support for English learners in content classes in order to build academic success.",
    "Prerequisites": "Preapproval by the ELL teacher is required based on the TN state ESL regulations.",
    "Counseling Notes": "This course may serve as either an elective or English credit. It may be taken one or two times per year as determined by language proficiency assessment scores.  This course can also count towards a humanities area of focus."
  },
  "803015": {
    "name": "Detective Fiction and Mystery Literature",
    "GPA": "4.0",
    "Credits": ["0.5"],
    "Subject": ["English"],
    "Length": ["Term"],
    "Description": "A comprehensive study of Detective Fiction and Mystery Literature for grades 10-12, after students have completed at least English 9. Students will read several novels and short stories, focusing on the elements of detective fiction, in world, American, and British literature.",
    "Prerequisites": "English 9",
    "Counseling Notes": "None"
  },
  "803016": {
    "name": "World Mythology",
    "GPA": "4.0",
    "Credits": ["0.5"],
    "Subject": ["English"],
    "Length": ["Term"],
    "Description": "Mythology is the study of a (usually older) culture’s search for answers about “life, the Universe, and everything” (Douglas Adams). This can range from questions about earth and humanity’s origins, to explanations of natural phenomena, to stories about human behavior (and misbehavior), to when and how existence ends. The best place to begin is with a refresher on Greek myth and its Roman counterparts. Those will serve as a point of comparison as the course examines the myths and cultures of the Egyptians, the Hindu, the Irish, and the Norse. As time allows, study will shift to Central/South American and Asian mythologies. Students will also be expected to complete an independent research project on a Native American myth. Goals of the course will be for students to learn the major figures and stories of each older culture’s myths, to understand how environment and culture influence a society’s view of the world, and to look past superficial differences in order to realize the common origins and elements that connect all humans.",
    "Prerequisites": "English 9",
    "Counseling Notes": "None"
  }
}
